cypress/pdl/devices/psoc6/svd/psoc6a2m.svd
        <value>133</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_3</name>
        <description>TCPWM #1, Counter #3</description>
        <value>134</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_4</name>
        <description>TCPWM #1, Counter #4</description>
        <value>135</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_5</name>
        <description>TCPWM #1, Counter #5</description>
        <value>136</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_6</name>
        <description>TCPWM #1, Counter #6</description>
        <value>137</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_7</name>
        <description>TCPWM #1, Counter #7</description>
        <value>138</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_8</name>
        <description>TCPWM #1, Counter #8</description>
        <value>139</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_9</name>
        <description>TCPWM #1, Counter #9</description>
        <value>140</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_10</name>
        <description>TCPWM #1, Counter #10</description>
        <value>141</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_11</name>
        <description>TCPWM #1, Counter #11</description>
        <value>142</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_12</name>
        <description>TCPWM #1, Counter #12</description>
        <value>143</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_13</name>
        <description>TCPWM #1, Counter #13</description>
        <value>144</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_14</name>
        <description>TCPWM #1, Counter #14</description>
        <value>145</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_15</name>
        <description>TCPWM #1, Counter #15</description>
        <value>146</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_16</name>
        <description>TCPWM #1, Counter #16</description>
        <value>147</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_17</name>
        <description>TCPWM #1, Counter #17</description>
        <value>148</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_18</name>
        <description>TCPWM #1, Counter #18</description>
        <value>149</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_19</name>
        <description>TCPWM #1, Counter #19</description>
        <value>150</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_20</name>
        <description>TCPWM #1, Counter #20</description>
        <value>151</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_21</name>
        <description>TCPWM #1, Counter #21</description>
        <value>152</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_22</name>
        <description>TCPWM #1, Counter #22</description>
        <value>153</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_23</name>
        <description>TCPWM #1, Counter #23</description>
        <value>154</value>
      </interrupt>
      <interrupt>
        <name>pass_interrupt_sar</name>
        <description>SAR ADC interrupt</description>
        <value>155</value>
      </interrupt>
      <interrupt>
        <name>audioss_0_interrupt_i2s</name>
        <description>I2S0 Audio interrupt</description>
        <value>156</value>
      </interrupt>
      <interrupt>
        <name>audioss_0_interrupt_pdm</name>
        <description>PDM0/PCM0 Audio interrupt</description>
        <value>157</value>
      </interrupt>
      <interrupt>
        <name>audioss_1_interrupt_i2s</name>
        <description>I2S1 Audio interrupt</description>
        <value>158</value>
      </interrupt>
      <interrupt>
        <name>profile_interrupt</name>
        <description>Energy Profiler interrupt</description>
        <value>159</value>
      </interrupt>
      <interrupt>
        <name>smif_interrupt</name>
        <description>Serial Memory Interface interrupt</description>
        <value>160</value>
      </interrupt>
      <interrupt>
        <name>usb_interrupt_hi</name>
        <description>USB Interrupt</description>
        <value>161</value>
      </interrupt>
      <interrupt>
        <name>usb_interrupt_med</name>
        <description>USB Interrupt</description>
        <value>162</value>
      </interrupt>
      <interrupt>
        <name>usb_interrupt_lo</name>
        <description>USB Interrupt</description>
        <value>163</value>
      </interrupt>
      <interrupt>
        <name>sdhc_0_interrupt_wakeup</name>
        <description>SDIO wakeup interrupt for mxsdhc</description>
        <value>164</value>
      </interrupt>
      <interrupt>
        <name>sdhc_0_interrupt_general</name>
        <description>Consolidated interrupt for mxsdhc for everything else</description>
        <value>165</value>
      </interrupt>
      <interrupt>
        <name>sdhc_1_interrupt_wakeup</name>
        <description>EEMC wakeup interrupt for mxsdhc, not used</description>
        <value>166</value>
      </interrupt>
      <interrupt>
        <name>sdhc_1_interrupt_general</name>
        <description>Consolidated interrupt for mxsdhc for everything else</description>
        <value>167</value>
      </interrupt>
      <registers>
        <register>
          <name>IDENTITY</name>
          <description>Identity</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>P</name>
              <description>This field specifies the privileged setting ('0': user mode; '1': privileged mode) of the transfer that reads the register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NS</name>
              <description>This field specifies the security setting ('0': secure mode; '1': non-secure mode) of the transfer that reads the register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PC</name>
              <description>This field specifies the protection context of the transfer that reads the register.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MS</name>
              <description>This field specifies the bus master identifier of the transfer that reads the register.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM4_STATUS</name>
          <description>CM4 status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x13</resetValue>
          <resetMask>0x13</resetMask>
          <fields>
            <field>
              <name>SLEEPING</name>
              <description>Specifies if the CPU is in Active, Sleep or DeepSleep power mode:
- Active power mode: SLEEPING is '0'.
- Sleep power mode: SLEEPING is '1' and SLEEPDEEP is '0'.
- DeepSleep power mode: SLEEPING is '1' and SLEEPDEEP is '1'.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SLEEPDEEP</name>
              <description>Specifies if the CPU is in Sleep or DeepSleep power mode. See SLEEPING field.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWR_DONE</name>
              <description>After a PWR_MODE change this flag indicates if the new power mode has taken effect or not. 
Note: this flag can also change as a result of  a change in debug power up req</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM4_CLOCK_CTL</name>
          <description>CM4 clock control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF00</resetMask>
          <fields>
            <field>
              <name>FAST_INT_DIV</name>
              <description>Specifies the fast clock divider (from the high frequency clock 'clk_hf' to the peripheral clock 'clk_fast'). Integer division by (1+FAST_INT_DIV). Allows for integer divisions in the range [1, 256] (FAST_INT_DIV is in the range [0, 255]).
 
Note that this field is retained. However, the counter that is used to implement the division is not and will be initialized by HW to '0' when transitioning from DeepSleep to Active power mode.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM4_CTL</name>
          <description>CM4 control</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x9F000000</resetMask>
          <fields>
            <field>
              <name>IOC_MASK</name>
              <description>CPU floating point unit (FPU) exception mask for the CPU's FPCSR.IOC 'invalid operation' exception condition:
'0': The CPU's exception condition does NOT activate the CPU's floating point interrupt. 
'1': the CPU's exception condition activates the CPU's floating point interrupt. 

Note: the ARM architecture does NOT support FPU exceptions; i.e. there is no precise FPU exception handler. Instead, FPU conditions are captured in the CPU's FPCSR register and the conditions are provided as CPU interface signals. The interface signals are 'masked' with the fields a provide by this register (CM7_0_CTL). The 'masked' signals are reduced/OR-ed into a single CPU floating point interrupt signal. The associated CPU interrupt handler allows for imprecise handling of FPU exception conditions.

Note: the CPU's FPCSR exception conditions are 'sticky'. Typically, the CPU FPU interrupt handler will clear the exception condition(s) to '0'.

Note: by default, the FPU exception masks are '0'. Therefore, FPU exception conditions will NOT activate the CPU's floating point interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DZC_MASK</name>
              <description>CPU FPU exception mask for the CPU's FPCSR.DZC 'divide by zero' exception condition:
'0': The CPU's exception condition does NOT activate the CPU's floating point interrupt. 
'1': the CPU's exception condition activates the CPU's floating point interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OFC_MASK</name>
              <description>CPU FPU exception mask for the CPU's FPCSR.OFC 'overflow' exception condition:
'0': The CPU's exception condition does NOT activate the CPU's floating point interrupt. 
'1': the CPU's exception condition activates the CPU's floating point interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UFC_MASK</name>
              <description>CPU FPU exception mask for the CPU's FPCSR.UFC 'underflow' exception condition:
'0': The CPU's exception condition does NOT activate the CPU's floating point interrupt. 
'1': the CPU's exception condition activates the CPU's floating point interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IXC_MASK</name>
              <description>CPU FPU exception mask for the CPU's FPCSR.IXC 'inexact' exception condition:
'0': The CPU's exception condition does NOT activate the CPU's floating point interrupt. 
'1': the CPU's exception condition activates the CPU's floating point interrupt.

