cypress/pdl/devices/psoc6/svd/psoc6a2m.svd
Note: this register field (and associated fault source data in DATA0 through DATA3) should only be considered valid, when VALID is '1'.</description>
                <bitRange>[6:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MPU_0</name>
                    <description>Bus master 0 MPU/SMPU.
DATA0[31:0]: Violating address.
DATA1[0]: User read.
DATA1[1]: User write.
DATA1[2]: User execute.
DATA1[3]: Privileged read.
DATA1[4]: Privileged write.
DATA1[5]: Privileged execute.
DATA1[6]: Non-secure.
DATA1[11:8]: Master identifier.
DATA1[15:12]: Protection context identifier.
DATA1[31]: '0' MPU violation; '1': SMPU violation.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_1</name>
                    <description>Bus master 1 MPU. See MPU_0 description.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_2</name>
                    <description>Bus master 2 MPU. See MPU_0 description.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_3</name>
                    <description>Bus master 3 MPU. See MPU_0 description.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_4</name>
                    <description>Bus master 4 MPU. See MPU_0 description.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_5</name>
                    <description>Bus master 5 MPU. See MPU_0 description.</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_6</name>
                    <description>Bus master 6 MPU. See MPU_0 description.</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_7</name>
                    <description>Bus master 7 MPU. See MPU_0 description.</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_8</name>
                    <description>Bus master 8 MPU. See MPU_0 description.</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_9</name>
                    <description>Bus master 9 MPU. See MPU_0 description.</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_10</name>
                    <description>Bus master 10 MPU. See MPU_0 description.</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_11</name>
                    <description>Bus master 11 MPU. See MPU_0 description.</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_12</name>
                    <description>Bus master 12 MPU. See MPU_0 description.</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_13</name>
                    <description>Bus master 13 MPU. See MPU_0 description.</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_14</name>
                    <description>Bus master 14 MPU. See MPU_0 description.</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MPU_15</name>
                    <description>Bus master 15 MPU. See MPU_0 description.</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CM4_SYS_MPU</name>
                    <description>CM4 system bus AHB-Lite interface MPU. See MPU_0 description.</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CM4_CODE_MPU</name>
                    <description>CM4 code bus AHB-Lite interface MPU for non flash controller accesses. See MPU_0 description.</description>
                    <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CM4_CODE_FLASHC_MPU</name>
                    <description>CM4 code bus AHB-Lite interface MPU for flash controller accesses. See MPU_0 description.</description>
                    <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MS_PPU_4</name>
                    <description>Peripheral interconnect, master interface 4 PPU. See MS_PPU_0 description.</description>
                    <value>25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PERI_ECC</name>
                    <description>Peripheral interconnect, protection structures SRAM, correctable ECC error:
DATA0[10:0]: Violating address.
DATA1[7:0]: Syndrome of SRAM word.</description>
                    <value>26</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PERI_NC_ECC</name>
                    <description>Peripheral interconnect, protection structures SRAM, non-correctable ECC error. See PERI_ECC description.</description>
                    <value>27</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MS_PPU_0</name>
                    <description>Peripheral interconnect, master interface 0 PPU.
DATA0[31:0]: Violating address.
DATA1[0]: User read.
DATA1[1]: User write.
DATA1[2]: User execute.
DATA1[3]: Privileged read.
DATA1[4]: Privileged write.
DATA1[5]: Privileged execute.
DATA1[6]: Non-secure.
DATA1[11:8]: Master identifier.
DATA1[15:12]: Protection context identifier.
DATA1[31:28]: '0': master interface, PPU violation, '1': timeout detected, '2': bus error, other: undefined.</description>
                    <value>28</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MS_PPU_1</name>
                    <description>Peripheral interconnect, master interface 1 PPU. See MS_PPU_0 description.</description>
                    <value>29</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MS_PPU_2</name>
                    <description>Peripheral interconnect, master interface 2 PPU. See MS_PPU_0 description.</description>
                    <value>30</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MS_PPU_3</name>
                    <description>Peripheral interconnect, master interface 3 PPU. See MS_PPU_0 description.</description>
                    <value>31</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_0</name>
                    <description>Peripheral group 0 fault detection.
DATA0[31:0]: Violating address.
DATA1[0]: User read.
DATA1[1]: User write.
DATA1[2]: User execute.
DATA1[3]: Privileged read.
DATA1[4]: Privileged write.
DATA1[5]: Privileged execute.
DATA1[6]: Non-secure.
DATA1[11:8]: Master identifier.
DATA1[15:12]: Protection context identifier.
DATA1[31:28]: '0': decoder or peripheral bus error, other: undefined.</description>
                    <value>32</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_1</name>
                    <description>Peripheral group 1 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>33</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_2</name>
                    <description>Peripheral group 2 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>34</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_3</name>
                    <description>Peripheral group 3 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>35</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_4</name>
                    <description>Peripheral group 4 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>36</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_5</name>
                    <description>Peripheral group 5 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>37</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_6</name>
                    <description>Peripheral group 6 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>38</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_7</name>
                    <description>Peripheral group 7 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>39</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_8</name>
                    <description>Peripheral group 8 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>40</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_9</name>
                    <description>Peripheral group 9 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>41</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_10</name>
                    <description>Peripheral group 10 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>42</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_11</name>
                    <description>Peripheral group 11 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>43</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_12</name>
                    <description>Peripheral group 12 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>44</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_13</name>
                    <description>Peripheral group 13 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>45</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_14</name>
                    <description>Peripheral group 14 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>46</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GROUP_FAULT_15</name>
                    <description>Peripheral group 15 fault detection. See GROUP_FAULT_0 description.</description>
                    <value>47</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLASHC_MAIN_BUS_ERROR</name>
                    <description>Flash controller, main interface, bus error:
FAULT_DATA0[31:0]: Violating address.
FAULT_DATA1[11:8]: Master identifier.</description>
                    <value>48</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLASHC_MAIN_C_ECC</name>
                    <description>Flash controller, main interface, correctable ECC error:
DATA[26:0]: Violating address.
DATA1[7:0]: Syndrome of 64-bit word (at address offset 0x00).
DATA1[15:8]: Syndrome of 64-bit word (at address offset 0x08).
DATA1[23:16]: Syndrome of 64-bit word (at address offset 0x10).
DATA1[31:24]: Syndrome of 64-bit word (at address offset 0x18).</description>
                    <value>49</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLASHC_MAIN_NC_ECC</name>
                    <description>Flash controller, main interface, non-correctable ECC error.  See FLASHC_MAIN_C_ECC description.</description>
                    <value>50</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLASHC_WORK_BUS_ERROR</name>
                    <description>Flash controller, work interface, bus error.
FAULT_DATA0[31:0]: Violating address.
FAULT_DATA1[11:8]: Master identifier.</description>
                    <value>51</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLASHC_WORK_C_ECC</name>
                    <description>Flash controller, work interface, correctable ECC error:
DATA0[26:0]: Violating address.
DATA1[6:0]: Syndrome of 32-bit word.</description>
                    <value>52</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLASHC_WORK_NC_ECC</name>
                    <description>Flash controller, work interface, non-correctable ECC error. See FLASHC_WORK_C_ECC description.</description>
                    <value>53</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLASHC_CM0_CA_C_ECC</name>
                    <description>Flash controller, CM0+ cache, correctable ECC error:
DATA0[26:0]: Violating address.
DATA1[6:0]: Syndrome of 32-bit SRAM word (at address offset 0x0).
DATA1[14:8]: Syndrome of 32-bit SRAM word (at address offset 0x4).
DATA1[22:16]: Syndrome of 32-bit SRAM word (at address offset 0x8).
DATA1[30:24]: Syndrome of 32-bit SRAM word (at address offset 0xc).</description>
                    <value>54</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLASHC_CM0_CA_NC_ECC</name>
                    <description>Flash controller, CM0+ cache, non-correctable ECC error.  See FLASHC_CM0_CA_C_ECC description.</description>
                    <value>55</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLASHC_CM4_CA_C_ECC</name>
                    <description>Flash controller, CM4 cache, correctable ECC error. See FLASHC_CM0_CA_C_ECC description.</description>
                    <value>56</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLASHC_CM4_CA_NC_ECC</name>
                    <description>Flash controller, CM4 cache, non-correctable ECC error. See FLASHC_CM0_CA_C_ECC description.</description>
                    <value>57</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RAMC0_C_ECC</name>
                    <description>System SRAM 0 correctable ECC error:
DATA0[31:0]: Violating address.
DATA1[6:0]: Syndrome of 32-bit SRAM code word.</description>
                    <value>58</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RAMC0_NC_ECC</name>
                    <description>System SRAM 0 non-correctable ECC error.  See RAMC0_C_ECC description.</description>
                    <value>59</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RAMC1_C_ECC</name>
                    <description>System SRAM 1 correctable ECC error. See RAMC0_C_ECC description.</description>
                    <value>60</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RAMC1_NC_ECC</name>
                    <description>System SRAM 1 non-correctable ECC error. See RAMC0_C_ECC description.</description>
                    <value>61</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RAMC2_C_ECC</name>
                    <description>System SRAM 2 correctable ECC error. See RAMC0_C_ECC description.</description>
                    <value>62</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RAMC2_NC_ECC</name>
                    <description>System SRAM 2 non-correctable ECC error. See RAMC0_C_ECC description.</description>
                    <value>63</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CRYPTO_C_ECC</name>
                    <description>Cryptography SRAM correctable ECC error.
DATA0[31:0]: Violating address.
DATA1[6:0]:   Syndrome of Least Significant 32-bit SRAM.
DATA1[14:8]: Syndrome of Most Significant 32-bit SRAM.</description>
                    <value>64</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CRYPTO_NC_ECC</name>
                    <description>Cryptography SRAM non-correctable ECC error. See CRYPTO_C_ECC description.</description>
                    <value>65</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DW0_C_ECC</name>
                    <description>DataWire 0 SRAM 1 correctable ECC error:
DATA0[11:0]: Violating DW SRAM address (word address, assuming byte addressible).
DATA1[6:0]: Syndrome of 32-bit SRAM code word.</description>
                    <value>70</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DW0_NC_ECC</name>
                    <description>DataWire 0 SRAM 1 non-correctable ECC error. See DW0_C_ECC description.</description>
                    <value>71</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DW1_C_ECC</name>
                    <description>DataWire 1 SRAM 1 correctable ECC error. See DW0_C_ECC description.</description>
                    <value>72</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DW1_NC_ECC</name>
                    <description>DataWire 1 SRAM 1 non-correctable ECC error. See DW0_C_ECC description.</description>
                    <value>73</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FM_SRAM_C_ECC</name>
                    <description>eCT Flash SRAM (for embedded operations) correctable ECC error:
DATA0[15:0]: Address location in the eCT Flash SRAM.
DATA1[6:0]: Syndrome of 32-bit SRAM word.</description>
                    <value>74</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FM_SRAM_NC_ECC</name>
                    <description>eCT Flash SRAM non-correctable ECC error: See FM_SRAM_C_ECC description.</description>
                    <value>75</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CAN0_C_ECC</name>
                    <description>CAN controller 0 MRAM correctable ECC error:
DATA0[15:0]: Violating address.
DATA0[22:16]: ECC violating data[38:32] from MRAM.
DATA0[27:24]: Master ID: 0-7 = CAN channel ID within mxttcanfd cluster, 8 = AHB I/F
DATA1[31:0]: ECC violating data[31:0] from MRAM.</description>
                    <value>80</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CAN0_NC_ECC</name>
                    <description>CAN controller 0 MRAM non-correctable ECC error:
DATA0[15:0]: Violating address.
DATA0[22:16]: ECC violating data[38:32] from MRAM (not for Address Error).
DATA0[27:24]: Master ID: 0-7 = CAN channel ID within mxttcanfd cluster, 8 = AHB I/F
DATA0[30]: Write access, only possible for Address Error 
DATA0[31]: Address Error: a CAN channel did an MRAM access above MRAM_SIZE
DATA1[31:0]: ECC violating data[31:0] from MRAM (not for Address Error).</description>
                    <value>81</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CAN1_C_ECC</name>
                    <description>CAN controller 1 MRAM correctable ECC error. See CAN0_C_ECC description.</description>
                    <value>82</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CAN1_NC_ECC</name>
                    <description>CAN controller 1 MRAM non-correctable ECC error. See CAN0_NC_ECC description.</description>
                    <value>83</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CAN2_C_ECC</name>
                    <description>CAN controller 2 MRAM correctable ECC error. See CAN0_C_ECC description.</description>
                    <value>84</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CAN2_NC_ECC</name>
                    <description>CAN controller 2 MRAM non-correctable ECC error. See CAN0_NC_ECC description.</description>
                    <value>85</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SRSS_CSV</name>
                    <description>SRSS Clock SuperVisor (CSV) violation detected. Multiple CSV can detect a violation at the same time.
DATA0[15:0]: CSV violation occurred on corresponding clk_hf* root clock
DATA0[24]: CSV violation occurred on reference clock for clk_hf CSVs
DATA0[25]: CSV violation occurred on clk_lf
DATA0[26]: CSV violation occurred on clk_ilo0</description>
                    <value>90</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SRSS_SSV</name>
                    <description>SRSS Supply SuperVisor (SSV) violation detected. Multiple SSV can detect a violation at the same time.
DATA0[0]: BOD detected on VDDA
DATA0[1]: OVD detected on VDDA
DATA0[16]: violation detected on LVD/HVD #1 
DATA0[17]: violation detected on LVD/HVD #2</description>
                    <value>91</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SRSS_MCWDT0</name>
