cypress/pdl/devices/psoc6/svd/psoc6a2m.svd
          <register>
            <name>PSTATE_REG</name>
            <description>Present State Register</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFBFF0FFF</resetMask>
            <fields>
              <field>
                <name>CMD_INHIBIT</name>
                <description>Command Inhibit (CMD)
This bit indicates the following :
- SD/eMMC mode: If this bit is set to 0, it indicates that the
CMD line is not in use and the Host controller can issue
an SD/eMMC command using the CMD line. This bit is
set when the command register is written. This bit is
cleared when the command response is received. This bit
is not cleared by the response of auto CMD12/23 but
cleared by the response of read/write command.
- UHS-II mode: If this bit is set to 0, it indicates that a
command packet can be issued by the Host Controller.
Values:
- 0x0 (READY): Host Controller is ready to issue a
command
- 0x1 (NOT_READY): Host Controller is not ready to issue
a command</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CMD_INHIBIT_DAT</name>
                <description>Command Inhibit (DAT)
This bit is applicable for SD/eMMC mode and is generated if
either DAT line active or Read transfer active is set to 1. If
this bit is set to 0, it indicates that the Host Controller can
issue subsequent SD/eMMC commands. For the UHS-II
mode, this bit is irrelevant and always returns 0.
Values:
- 0x0 (READY): Can issue command which used DAT line
- 0x1 (NOT_READY): Cannot issue command which used
DAT line</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DAT_LINE_ACTIVE</name>
                <description>DAT Line Active (SD/eMMC Mode only)
This bit indicates whether one of the DAT lines on the
SD/eMMC bus is in use. This bit is irrelevant for the UHS-II
mode.
In the case of read transactions, this bit indicates whether a
read transfer is executing on the SD/eMMC bus.
In the case of write transactions, this bit indicates whether a
write transfer is executing on the SD/eMMC bus.
For a command with busy, this status indicates whether the
command executing busy is executing on an SD or eMMC
bus.
Values:
- 0x0 (INACTIVE): DAT Line Inactive
- 0x1 (ACTIVE): DAT Line Active</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RE_TUNE_REQ</name>
                <description>Re-Tuning Request
DWC_mshc does not generate retuning request. The
software must maintain the Retuning timer.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DAT_7_4</name>
                <description>DAT[7:4] Line Signal Level
This bit is used to check the DAT line level to recover from
errors and for debugging. These bits reflect the value of the
sd_dat_in (upper nibble) signal. These bits are irrelevant for
the UHS-II mode and always return 0.</description>
                <bitRange>[7:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>WR_XFER_ACTIVE</name>
                <description>Write Transfer Active
This status indicates whether a write transfer is active for
SD/eMMC mode. It is irrelevant for UHS-II mode and always
returns 0.
Values:
- 0x0 (INACTIVE): No valid data
- 0x1 (ACTIVE): Transferring data</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RD_XFER_ACTIVE</name>
                <description>Read Transfer Active
This bit indicates whether a read transfer is active for
SD/eMMC mode. This bit irrelevant for the UHS-II mode and
always returns 0.
Values:
- 0x0 (INACTIVE): No valid data
- 0x1 (ACTIVE): Transferring data</description>
                <bitRange>[9:9]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BUF_WR_ENABLE</name>
                <description>Buffer Write Enable
This bit is used for non-DMA transfers. This bit is set if space
is available for writing data.
Values:
- 0x0 (DISABLED): Write disable
- 0x1 (ENABLED): Write enable</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BUF_RD_ENABLE</name>
                <description>Buffer Read Enable
This bit is used for non-DMA transfers. This bit is set if valid
data exists in the Host buffer.
Values:
- 0x0 (DISABLED): Read disable
- 0x1 (ENABLED): Read enable</description>
                <bitRange>[11:11]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CARD_INSERTED</name>
                <description>Card Inserted
This bit indicates whether a card has been inserted. The
Host Controller debounces this signal so that Host Driver
need not wait for it to stabilize.
Values:
- 0x0 (FALSE): Reset, Debouncing, or No card
- 0x1 (TRUE): Card Inserted</description>
                <bitRange>[16:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CARD_STABLE</name>
                <description>Card Stable
This bit indicates the stability of the Card Detect Pin Level. A
card is not detected if this bit is set to 1 and the value of the
CARD_INSERTED bit is 0.
Values:
- 0x0 (FALSE): Reset or Debouncing
- 0x1 (TRUE): No Card or Inserted</description>
                <bitRange>[17:17]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CARD_DETECT_PIN_LEVEL</name>
                <description>Card Detect Pin Level
This bit reflects the inverse synchronized value of the
card_detect_n signal.
Values:
- 0x0 (FALSE): No card present
- 0x1 (TRUE): Card Present</description>
                <bitRange>[18:18]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>WR_PROTECT_SW_LVL</name>
                <description>Write Protect Switch Pin Level
This bit is supported only for memory and combo cards. This
bit reflects the synchronized value of the card_write_prot
signal.
Values:
- 0x0 (FALSE): Write protected
- 0x1 (TRUE): Write enabled</description>
                <bitRange>[19:19]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DAT_3_0</name>
                <description>DAT[3:0] Line Signal Level
This bit is used to check the DAT line level to recover from
errors and for debugging. These bits reflect the value of the
sd_dat_in (lower nibble) signal. These bits are irrelevant for
the UHS-II mode and always returns 0.</description>
                <bitRange>[23:20]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CMD_LINE_LVL</name>
                <description>Command-Line Signal Level
This bit is used to check the CMD line level to recover from
errors and for debugging. These bits reflect the value of the
sd_cmd_in signal. This bit is irrelevant for an UHS-II mode
and always returns 0.</description>
                <bitRange>[24:24]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HOST_REG_VOL</name>
                <description>Host Regulator Voltage Stable
This bit is used to check whether the host regulator voltage is
stable for switching the voltage of UHS-I mode. This bit
reflects the synchronized value of the host_reg_vol_stable
signal.
Values:
- 0x0 (FALSE): Host Regulator Voltage is not stable
- 0x1 (TRUE): Host Regulator Voltage is stable</description>
                <bitRange>[25:25]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CMD_ISSU_ERR</name>
                <description>Command Not Issued by Error
This bit is set if a command cannot be issued after setting
the command register due to an error except the Auto
CMD12 error.
Values:
- 0x0 (FALSE): No error for issuing a command
- 0x1 (TRUE): Command cannot be issued</description>
                <bitRange>[27:27]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SUB_CMD_STAT</name>
                <description>Sub Command Status
This bit is used to distinguish between a main command and
a sub command status.
Values:
- 0x0 (FALSE): Main Command Status
- 0x1 (TRUE): Sub Command Status</description>
                <bitRange>[28:28]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_DORMANT_ST</name>
                <description>In Dormant Status
This bit indicates whether UHS-II lanes enter Dormant state
in the UHS-II mode. For SD/eMMC mode, this bit always
returns 0.
Values:
- 0x0 (FALSE): Not in DORMANT state
- 0x1 (TRUE): In DORMANT state</description>
                <bitRange>[29:29]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>LANE_SYNC</name>
                <description>Lane Synchronization
This bit indicates whether a lane is synchronized in the UHSII
mode. For SD/eMMC mode, this bit always returns 0.
Values:
- 0x0 (FALSE): UHS-II PHY is not initialized
- 0x1 (TRUE): UHS-II PHY is initialized</description>
                <bitRange>[30:30]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>UHS2_IF_DETECT</name>
                <description>UHS-II Interface Detection
This bit indicates whether a card supports the UHS-II
interface. For SD/eMMC mode, this bit always returns 0.
Values:
- 0x0 (FALSE): UHS-II interface is not detected
- 0x1 (TRUE): UHS-II interface is detected</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HOST_CTRL1_R</name>
            <description>Host Control 1 Register</description>
            <addressOffset>0x28</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>LED_CTRL</name>
                <description>LED Control
This bit is used to caution the user not to remove the card
while the SD card is being accessed. The value is reflected
on the led_ctrl ouput.
Values:
- 0x0 (OFF): LED off
- 0x1 (ON): LED on</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DAT_XFER_WIDTH</name>
                <description>Data Transfer Width
For SD/eMMC mode,this bit selects the data transfer width of
the Host Controller. The Host Driver sets it to match the data
width of the SD/eMMC card. In UHS-II mode, this bit is
irrelevant.
Values:
- 0x1 (FOUR_BIT): 4-bit mode
- 0x0 (ONE_BIT): 1-bit mode</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HIGH_SPEED_EN</name>
                <description>High Speed Enable (SD/eMMC Mode only)
In SD/eMMC mode, this bit is used to determine the
selection of preset value for High Speed mode. Before
setting this bit, the Host Driver checks the High Speed
Support in the Capabilities register.
Note: DWC_MSHC always outputs the sd_cmd_out and
sd_dat_out lines at the rising edge of cclk_tx clock
irrespective of this bit.Please refer the section Connecting
the Clock IO interface in the Mobile Storage Host Controller
user guide on clocking requirement for an SD/eMMC card.
In UHS-II mode, this bit is irrelevant.
Values:
- 0x1 (HIGH_SPEED): High Speed mode
- 0x0 (NORMAL_SPEED): Normal Speed mode</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DMA_SEL</name>
                <description>N/A</description>
                <bitRange>[4:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EXT_DAT_XFER</name>
                <description>Extended Data Transfer Width
This bit controls 8-bit bus width mode of embedded device.
This bit is not applicable for UHS-II mode.
Values:
- 0x1 (EIGHT_BIT): 8-bit Bus Width
- 0x0 (DEFAULT): Bus Width is selected by the Data
Transfer Width</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_DETECT_TEST_LVL</name>
                <description>Card Detect Test Level
This bit is enabled while the Card Detect Signal Selection is
set to 1 and it indicates whether a card inserted or not.
Values:
- 0x1 (CARD_INSERTED): Card Inserted
- 0x0 (No_CARD): No Card</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_DETECT_SIG_SEL</name>
                <description>Card Detect Signal Selection
This bit selects a source for card detection. When the source
for the card detection is switched, the interrupt must be
disabled during the switching period.
Values:
- 0x1 (CARD_DT_TEST_LEVEL): Card Detect Test Level
is selected (for test purpose)
- 0x0 (SDCD_PIN): SDCD# (card_detect_n signal) is
selected (for normal use)</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PWR_CTRL_R</name>
            <description>Power Control Register</description>
            <addressOffset>0x29</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>SD_BUS_PWR_VDD1</name>
                <description>SD Bus Power for VDD1
This bit enables VDD1 power of the card. This setting is
available on the card_if_pwr_en output so that it
can be used to control the VDD1 power supply of the card.
Before setting this bit, the SD Host Driver sets the SD Bus
Voltage Select bit. If the Host Controller detects a No Card
state, this bit is cleared.
In SD mode, if this bit is cleared, the Host Controller stops
the SD Clock by clearing the SD_CLK_IN bit in the
CLK_CTRL_R register.
In UHS-II mode, before clearing this bit, the Host Driver
clears the SD_CLK_IN bit in the CLK_CTRL_R register.
Values:
- 0x0 (OFF): Power off
- 0x1 (ON): Power on</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SD_BUS_VOL_VDD1</name>
                <description>These bits are NON-operational (they can be written and read but they have no effect).  In a generic HCI host these would select the card supply voltage.  But, for the applications targeted for this block it is assumed that the card supply voltage is always fixed at the board level.  If for some reason there is a variable power supply then that can be managed through normal GPIO programming separately.</description>
                <bitRange>[3:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SD_BUS_PWR_VDD2</name>
                <description>SD Bus Power for VDD2.
This bit enables VDD2 power of UHS-II card. This setting is
available on the sd_vdd2_on output of DWC_mshc so that it
can be used to control the VDD2 power supply of the card.
This is irrelevant for SD/eMMC card.
Values:
- 0x0 (OFF): Power off
- 0x1 (ON): Power on</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SD_BUS_VOL_VDD2</name>
                <description>N/A</description>
                <bitRange>[7:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BGAP_CTRL_R</name>
            <description>Block Gap Control Register</description>
            <addressOffset>0x2A</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>STOP_BG_REQ</name>
                <description>Stop At Block Gap Request
This bit is used to stop executing read and write transactions
at the next block gap for non-DMA, SDMA, and ADMA
transfers.
Values:
- 0x0 (XFER): Transfer
- 0x1 (STOP): Stop</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CONTINUE_REQ</name>
                <description>Continue Request
This bit is used to restart the transaction, which was stopped
using the Stop At Block Gap Request. The Host Controller
automatically clears this bit when the transaction restarts. If
stop at block gap request is set to 1, any write to this bit is
ignored.
Values:
- 0x0 (NO_AFFECT): No Affect
- 0x1 (RESTART): Restart</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RD_WAIT_CTRL</name>
                <description>N/A</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_AT_BGAP</name>
                <description>Interrupt At Block Gap
This bit is valid only in the 4-bit mode of an SDIO card and is
used to select a sample point in the interrupt cycle. Setting to
1 enables interrupt detection at the block gap for a multiple
block transfer. In UHS-II mode, this bit is disabled.
Values:
- 0x0 (DISABLE): Disabled
- 0x1 (ENABLE): Enabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WUP_CTRL_R</name>
            <description>Wakeup Control Register</description>
            <addressOffset>0x2B</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>WUP_CARD_INT</name>
                <description>Wakeup Event Enable on SDIO Card Interrupt (through DAT[2]).
This bit enables wakeup event through an SDIO Card Interrupt
assertion in the Normal Interrupt Status register. This bit can
be set to 1 if FN_WUS (Wake Up Support) in CIS is set to 1.
Values:
- 0x0 (DISABLED): Disable
- 0x1 (ENABLED): Enable</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WUP_CARD_INSERT</name>
                <description>Wakeup Event Enable on SD Card Insertion
This bit enables wakeup event through Card Insertion
assertion in the Normal Interrupt Status register. FN_WUS
(Wake Up Support) in CIS does not affect this bit.
Values:
- 0x0 (DISABLED): Disable
- 0x1 (ENABLED): Enable</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WUP_CARD_REMOVAL</name>
                <description>Wakeup Event Enable on SD Card Removal
This bit enables wakeup event through Card Removal
assertion in the Normal Interrupt Status register. For the
SDIO card, Wake Up Support (FN_WUS) in the Card
Information Structure (CIS) register does not affect this bit.
Values:
- 0x0 (DISABLED): Disable
- 0x1 (ENABLED): Enable</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
