cypress/pdl/devices/psoc6/svd/psoc6a2m.svd
          <register>
            <name>CLK_CTRL_R</name>
            <description>Clock Control Register</description>
            <addressOffset>0x2C</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFEF</resetMask>
            <fields>
              <field>
                <name>INTERNAL_CLK_EN</name>
                <description>Internal Clock Enable
This bit is set to 0 when the Host Driver is not using the Host
Controller or the Host Controller awaits a wakeup interrupt.
The Host Controller must stop its internal clock to enter a
very low power state. Certain registers are not accessible when this bit is off.  So, to be safe turn it on for any register access.  The value is reflected on the intclk_en signal.
Values:
- 0x0 (FALSE): Stop
- 0x1 (TRUE): Oscillate</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INTERNAL_CLK_STABLE</name>
                <description>Internal Clock Stable
This bit enables the Host Driver to check the clock stability
twice after the Internal Clock Enable bit is set and after the
PLL Enable bit is set. This bit reflects the synchronized
value of the intclk_stable signal after the Internal Clock
Enable bit is set to 1 and also reflects the synchronized
value of the card_clk_stable signal after the PLL Enable bit is
set to 1.
Values:
- 0x0 (FALSE): Not Ready
- 0x1 (TRUE): Ready</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SD_CLK_EN</name>
                <description>SD/eMMC Clock Enable
This bit stops the clk_card output when set to 0. The
SDCLK/RCLK Frequency Select bit can be changed when
this bit is set to 0.
Values:
- 0x0 (FALSE): Disable providing clk_card
- 0x1 (TRUE): Enable providing clk_card</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PLL_ENABLE</name>
                <description>PLL Enable
This bit is used to activate the PLL (applicable when Host
Version 4 Enable = 1). The value is reflected on the
card_clk_en signal.
Values:
- 0x0 (FALSE): PLL is in low power mode
- 0x1 (TRUE): PLL is enabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLK_GEN_SELECT</name>
                <description>Clock Generator Select
This bit is used to select the clock generator mode in
SDCLK/RCLK Frequency Select. If Preset Value Enable = 0,
this bit is set by the Host Driver. If Preset Value Enable = 1,
this bit is automatically set to a value specified in one of the
Preset Value registers. The value is reflected on the
card_clk_gen_sel signal.
Values:
- 0x0 (FALSE): Divided Clock Mode
- 0x1 (TRUE): Programmable Clock Mode</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>UPPER_FREQ_SEL</name>
                <description>These bits specify the upper 2 bits of 10-bit SDCLK/RCLK
Frequency Select control. The value is reflected on the upper
2 bits of the card_clk_freq_sel signal.</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FREQ_SEL</name>
                <description>SDCLK/RCLK Frequency Select
These bits are used to select the frequency of the SDCLK
signal. These bits depend on setting of Preset Value Enable
in the Host Control 2 register. If Preset Value Enable = 0,
these bits are set by the Host Driver. If Preset Value Enable =
1, these bits are automatically set to a value specified in one
of the Preset Value register. The value is reflected on the
lower 8-bit of the card_clk_freq_selsignal.
10-bit Divided Clock Mode:
- 0x3FF - 1/2046 Divided clock
- ..........
- N - 1/2N Divided Clock
- ..........
- 0x002 - 1/4 Divided Clock
- 0x001 - 1/2 Divided Clock
- 0x000 - Base clock (10MHz - 255 MHz)
Programmable Clock Mode - Enables the Host System to
select a fine grain SD clock frequency:
- 0x3FF - Base clock * M /1024
- ..........
- N-1 - Base clock * M /N
- ..........
- 0x002 - Base clock * M /3
- 0x001 - Base clock * M /2
- 0x000 - Base clock * M</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TOUT_CTRL_R</name>
            <description>Timeout Control Register</description>
            <addressOffset>0x2E</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>TOUT_CNT</name>
                <description>N/A</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SW_RST_R</name>
            <description>Software Reset Register</description>
            <addressOffset>0x2F</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>SW_RST_ALL</name>
                <description>Software Reset For All
This reset affects the entire Host Controller except for the
card detection circuit. During its initialization, the Host Driver
sets this bit to 1 to reset the Host Controller. All registers are
reset except the capabilities register. If this bit is set to 1, the
Host Driver must issue reset command and reinitialize the
card.
Values:
- 0x0 (FALSE): Work
- 0x1 (TRUE): Reset</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SW_RST_CMD</name>
                <description>Software Reset For CMD line
This bit resets only a part of the command circuit to be able
to issue a command. It bit is also used to initialize a UHS-II
command circuit. This reset is effective only for a command
issuing circuit (including response error statuses related to
Command Inhibit (CMD) control) and does not affect the
data transfer circuit. Host Controller can continue data
transfer even after this reset is executed while handling
subcommand-response errors.
The following registers and bits are cleared by this bit:
- Present State register - Command Inhibit (CMD) bit
- Normal Interrupt Status register - Command Complete bit
- Error Interrupt Status - Response error statuses related
to Command Inhibit (CMD) bit
Values:
- 0x0 (FALSE): Work
- 0x1 (TRUE): Reset</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SW_RST_DAT</name>
                <description>Software Reset For DAT line
This bit is used in SD/eMMC mode and it resets only a part
of the data circuit and the DMA circuit is also reset.
The following registers and bits are cleared by this bit:
- Buffer Data Port register
- Buffer is cleared and initialized.
- Present state register
- Buffer Read Enable
- Buffer Write Enable
- Read Transfer Active
- Write Transfer Active
- DAT Line Active
- Command Inhibit (DAT)
- Block Gap Control register
- Continue Request
- Stop At Block Gap Request
- Normal Interrupt status register
- Buffer Read Ready
- Buffer Write Ready
- DMA Interrupt
- Block Gap Event
- Transfer Complete
In UHS-II mode, this bit shall be set to 0
Values:
- 0x0 (FALSE): Work
- 0x1 (TRUE): Reset</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NORMAL_INT_STAT_R</name>
            <description>Normal Interrupt Status Register</description>
            <addressOffset>0x30</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CMD_COMPLETE</name>
                <description>Command Complete
In an SD/eMMC Mode, this bit is set when the end bit of a
response except for Auto CMD12 and Auto CMD23. In
UHS-II Mode, this bit is set when response packet is
received.
This interrupt is not generated when the Response Interrupt
Disable in Transfer Mode Register is set to 1.
Values:
- 0x0 (FALSE): No command complete
- 0x1 (TRUE): Command Complete</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>XFER_COMPLETE</name>
                <description>Transfer Complete
This bit is set when a read/write transfer and a command
with status busy is completed.
Values:
- 0x0 (FALSE): Not complete
- 0x1 (TRUE): Command execution is completed</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BGAP_EVENT</name>
                <description>Block Gap Event
This bit is set when both read/write transaction is stopped at
block gap due to a Stop at Block Gap Request.
Values:
- 0x0 (FALSE): No Block Gap Event
- 0x1 (TRUE): Transaction stopped at block gap</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DMA_INTERRUPT</name>
                <description>DMA Interrupt
This bit is set if the Host Controller detects the SDMA Buffer
Boundary during transfer. In case of ADMA, by setting the Int
field in the descriptor table, the Host controller generates this
interrupt. This interrupt is not generated after a Transfer
Complete.
Values:
- 0x0 (FALSE): No DMA Interrupt
- 0x1 (TRUE): DMA Interrupt is generated</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUF_WR_READY</name>
                <description>Buffer Write Ready
This bit is set if the Buffer Write Enable changes from 0 to 1.
Values:
- 0x0 (FALSE): Not ready to write buffer
- 0x1 (TRUE): Ready to write buffer</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUF_RD_READY</name>
                <description>Buffer Read Ready
This bit is set if the Buffer Read Enable changes from 0 to 1.
Values:
- 0x0 (FALSE): Not ready to read buffer
- 0x1 (TRUE): Ready to read buffer</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_INSERTION</name>
                <description>Card Insertion
This bit is set if the Card Inserted in the Present State
register changes from 0 to 1.
Values:
- 0x0 (FALSE): Card state stable or Debouncing
- 0x1 (TRUE): Card Inserted</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_REMOVAL</name>
                <description>Card Removal
This bit is set if the Card Inserted in the Present State
register changes from 1 to 0.
Values:
- 0x0 (FALSE): Card state stable or Debouncing
- 0x1 (TRUE): Card Removed</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_INTERRUPT</name>
                <description>Card Interrupt
This bit reflects the synchronized value of:
- DAT[1] Interrupt Input for SD Mode
- DAT[2] Interrupt Input for UHS-II Mode
Values:
- 0x0 (FALSE): No Card Interrupt
- 0x1 (TRUE): Generate Card Interrupt</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INT_A</name>
                <description>INT_A (Embedded)
This bit is set if INT_A is enabled and if INT_A# pin is in low
level. The INT_A# pin is not supported.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INT_B</name>
                <description>INT_B (Embedded)
This bit is set if INT_B is enabled and if INT_B# pin is in low
level. The INT_B# pin is not supported.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INT_C</name>
                <description>INT_C (Embedded)
This bit is set if INT_C is enabled and if INT_C# pin is in low
level. The INT_C# pin is not supported.</description>
                <bitRange>[11:11]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RE_TUNE_EVENT</name>
                <description>Re-tuning Event
This bit is set if the Re-Tuning Request changes from 0 to 1.
Re-Tuning request is not supported.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>FX_EVENT</name>
                <description>FX Event
This status is set when R[14] of response register is set to 1
and Response Type R1/R5 is set to 0 in Transfer Mode
register. This interrupt is used with response check function.
Values:
- 0x0 (FALSE): No Event
- 0x1 (TRUE): FX Event is detected</description>
                <bitRange>[13:13]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CQE_EVENT</name>
                <description>Command Queuing Event
This status is set if Command Queuing/Crypto related event
has occurred in eMMC/SD mode. Read CQHCI's
CQIS/CRNQIS register for more details. In UHS-II Mode,
this bit is irrelevant.
Values:
- 0x0 (FALSE): No Event
- 0x1 (TRUE): Command Queuing Event is detected</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ERR_INTERRUPT</name>
                <description>Error Interrupt
If any of the bits in the Error Interrupt Status register are set,
then this bit is set.
Values:
- 0x0 (FALSE): No Error
- 0x1 (TRUE): Error</description>
                <bitRange>[15:15]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
