cypress/pdl/devices/psoc6/svd/psoc6a2m.svd
          <register>
            <name>ERROR_INT_STAT_R</name>
            <description>Error Interrupt Status Register</description>
            <addressOffset>0x32</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CMD_TOUT_ERR</name>
                <description>Command Timeout Error
In SD/eMMC Mode,this bit is set only if no response is
returned within 64 SD clock cycles from the end bit of the
command. If the Host Controller detects a CMD line conflict,
along with Command CRC Error bit, this bit is set to 1,
without waiting for 64 SD/eMMC card clock cycles. In UHS-II
mode, this bit is irrelevant.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Time out</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_CRC_ERR</name>
                <description>Command CRC Error
Command CRC Error is generated in SD/eMMC mode for
following two cases.
- If a response is returned and the Command Timeout
Error is set to 0 (indicating no timeout), this bit is set to 1
when detecting a CRC error in the command response.
- The Host Controller detects a CMD line conflict by
monitoring the CMD line when a command is issued. If
the Host Controller drives the CMD line to 1 level, but
detects 0 level on the CMD line at the next SD clock
edge, then the Host Controller aborts the command (stop
driving CMD line) and set this bit to 1. The Command
Timeout Error is also set to 1 to distinguish a CMD line
conflict.
In UHS-II mode, this bit is irrelevant.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): CRC error generated</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_END_BIT_ERR</name>
                <description>Command End Bit Error
This bit is set when detecting that the end bit of a command
response is 0 in SD/eMMC mode.
In UHS-II mode, this bit is irrelevant.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): End Bit error generated</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_IDX_ERR</name>
                <description>Command Index Error
This bit is set if a Command Index error occurs in the
command respons in SD/eMMC mode.
In UHS-II mode, this bit is irrelevant.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Error</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_TOUT_ERR</name>
                <description>Data Timeout Error
This bit is set in SD/eMMC mode when detecting one of the
following timeout conditions:
- Busy timeout for R1b, R5b type
- Busy timeout after Write CRC status
- Write CRC Status timeout
- Read Data timeout
In UHS-II mode, this bit is irrelevant.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Time out</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_CRC_ERR</name>
                <description>Data CRC Error
This error occurs in SD/eMMC mode when detecting CRC
error when transferring read data which uses the DAT line,
when detecting the Write CRC status having a value of other
than 010 or when write CRC status timeout.
In UHS-II mode, this bit is irrelevant.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Error</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_END_BIT_ERR</name>
                <description>Data End Bit Error
This error occurs in SD/eMMC mode either when detecting 0
at the end bit position of read data that uses the DAT line or
at the end bit position of the CRC status.
In UHS-II mode, this bit is irrelevant.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Error</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CUR_LMT_ERR</name>
                <description>Current Limit Error
By setting the SD Bus Power bit in the Power Control
register, the Host Controller is requested to supply power for
the SD Bus. If the Host Controller supports the Current Limit
function, it can be protected from an illegal card by stopping
power supply to the card in which case this bit indicates a
failure status. A reading of 1 for this bit means that the Host
Controller is not supplying power to the SD card due to some
failure. A reading of 0 for this bit means that the Host
Controller is supplying power and no error has occurred. The
Host Controller may require some sampling time to detect
the current limit. DWC_mshc Host Controller does not
support this function, this bit is always set to 0.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Power Fail</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTO_CMD_ERR</name>
                <description>Auto CMD Error
This error status is used by Auto CMD12 and Auto CMD23 in
SD/eMMC mode. This bit is set when detecting that any of
the bits D00 to D05 in Auto CMD Error Status register has
changed from 0 to 1. D07 is effective in case of Auto CMD12.
Auto CMD Error Status register is valid while this bit is set to
1 and may be cleared by clearing of this bit.
In UHS-II mode, this bit is irrelevant.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Error</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADMA_ERR</name>
                <description>ADMA Error
This bit is set when the Host Controller detects error during
ADMA-based data transfer. The error could be due to
following reasons:
- Error response received from System bus (Master I/F)
- ADMA3,ADMA2 Descriptors invalid
- CQE Task or Transfer descriptors invalid
When the error occurs, the state of the ADMA is saved in the
ADMA Error Status register.
In eMMC CQE mode:
The Host Controller generates this Interrupt when it detects
an invalid descriptor data (Valid=0) at the ST_FDS state.
ADMA Error State in the ADMA Error Status indicates that
an error has occurred in ST_FDS state. The Host Driver may
find that Valid bit is not set at the error descriptor.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Error</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TUNING_ERR</name>
                <description>Tuning Error
This bit is set when an unrecoverable error is detected in a
tuning circuit except during the tuning procedure (occurrence
of an error during tuning procedure is indicated by Sampling
Clock Select in the Host Control 2 register). By detecting
Tuning Error, Host Driver needs to abort a command
executing and perform tuning. To reset tuning circuit,
Sampling Clock Select is set to 0 before executing tuning
procedure. The Tuning Error is higher priority than the other
error interrupts generated during data transfer. By detecting
Tuning Error, the Host Driver must discard data transferred
by a current read/write command and retry data transfer after
the Host Controller retrieved from the tuning circuit error.
This is applicable in SD/eMMC mode.
In UHS-II mode, this bit is irrelevant.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Error</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RESP_ERR</name>
                <description>Response Error
Host Controller Version 4.00 supports response error check
function to avoid overhead of response error check by Host
Driver during DMA execution. If Response Error Check
Enable is set to 1 in the Transfer Mode register, Host
Controller Checks R1 or R5 response. If an error is detected
in a response, this bit is set to 1.This is applicable in
SD/eMMC mode.
In UHS-II mode, this bit is irrelevant.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Error</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BOOT_ACK_ERR</name>
                <description>Boot Acknowledgement Error
This bit is set when there is a timeout for boot
acknowledgement or when detecting boot ack status having
a value other than 010. This is applicable only when boot
acknowledgement is expected in eMMC mode.
In SD/UHS-II mode, this bit is irrelevant.
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Error</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR1</name>
                <description>N/A</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR2</name>
                <description>N/A</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR3</name>
                <description>N/A</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NORMAL_INT_STAT_EN_R</name>
            <description>Normal Interrupt Status Enable Register</description>
            <addressOffset>0x34</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FFF</resetMask>
            <fields>
              <field>
                <name>CMD_COMPLETE_STAT_EN</name>
                <description>Command Complete Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>XFER_COMPLETE_STAT_EN</name>
                <description>Transfer Complete Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BGAP_EVENT_STAT_EN</name>
                <description>Block Gap Event Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DMA_INTERRUPT_STAT_EN</name>
                <description>DMA Interrupt Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUF_WR_READY_STAT_EN</name>
                <description>Buffer Write Ready Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUF_RD_READY_STAT_EN</name>
                <description>Buffer Read Ready Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_INSERTION_STAT_EN</name>
                <description>Card Insertion Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_REMOVAL_STAT_EN</name>
                <description>Card Removal Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_INTERRUPT_STAT_EN</name>
                <description>Card Interrupt Status Enable
If this bit is set to 0, the Host Controller clears the interrupt
request to the System. The Card Interrupt detection is
stopped when this bit is cleared and restarted when this bit is
set to 1. The Host Driver may clear the Card Interrupt Status
Enable before servicing the Card Interrupt and may set this
bit again after all interrupt requests from the card are cleared
to prevent inadvertent interrupts.
By setting this bit to 0, interrupt input must be masked by
implementation so that the interrupt input is not affected by
external signal in any state (for example, floating).
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_A_STAT_EN</name>
                <description>INT_A (Embedded) Status Enable
If this bit is set to 0, the Host Controller clears the interrupt
request to the System. The Host Driver may clear this bit
before servicing the INT_A and may set this bit again after all
interrupt requests to INT_A pin are cleared to prevent
inadvertent interrupts.
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_B_STAT_EN</name>
                <description>INT_B (Embedded) Status Enable
If this bit is set to 0, the Host Controller clears the interrupt
request to the System. The Host Driver may clear this bit
before servicing the INT_B and may set this bit again after all
interrupt requests to INT_B pin are cleared to prevent
inadvertent interrupts.
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_C_STAT_EN</name>
                <description>INT_C (Embedded) Status Enable
If this bit is set to 0, the Host Controller clears the interrupt
request to the System. The Host Driver may clear this bit
before servicing the INT_C and may set this bit again after all
interrupt requests to INT_C pin are cleared to prevent
inadvertent interrupts.
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RE_TUNE_EVENT_STAT_EN</name>
                <description>Re-Tuning Event (UHS-I only) Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FX_EVENT_STAT_EN</name>
                <description>FX Event Status Enable
This bit is added from Version 4.10.
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CQE_EVENT_STAT_EN</name>
                <description>CQE Event Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ERROR_INT_STAT_EN_R</name>
            <description>Error Interrupt Status Enable Register</description>
            <addressOffset>0x36</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CMD_TOUT_ERR_STAT_EN</name>
                <description>Command Timeout Error Status Enable (SD/eMMC Mode
only).
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_CRC_ERR_STAT_EN</name>
                <description>ommand CRC Error Status Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_END_BIT_ERR_STAT_EN</name>
                <description>Command End Bit Error Status Enable (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_IDX_ERR_STAT_EN</name>
                <description>Command Index Error Status Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_TOUT_ERR_STAT_EN</name>
                <description>Data Timeout Error Status Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_CRC_ERR_STAT_EN</name>
                <description>Data CRC Error Status Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_END_BIT_ERR_STAT_EN</name>
                <description>Data End Bit Error Status Enable (SD/eMMC Mode only).
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CUR_LMT_ERR_STAT_EN</name>
                <description>Current Limit Error Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTO_CMD_ERR_STAT_EN</name>
                <description>Auto CMD Error Status Enable (SD/eMMC Mode only).
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADMA_ERR_STAT_EN</name>
                <description>ADMA Error Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TUNING_ERR_STAT_EN</name>
                <description>Tuning Error Status Enable (UHS-I Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RESP_ERR_STAT_EN</name>
                <description>Response Error Status Enable (SD Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BOOT_ACK_ERR_STAT_EN</name>
                <description>Boot Acknowledgment Error (eMMC Mode only)
Setting this bit to 1 enables setting of Boot Acknowledgment
Error in Error Interrupt Status register
(ERROR_INT_STAT_R).
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR_STAT_EN1</name>
                <description>N/A</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR_STAT_EN2</name>
                <description>N/A</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR_STAT_EN3</name>
                <description>N/A</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
