cypress/pdl/devices/psoc6/svd/psoc6a2m.svd
          <register>
            <name>NORMAL_INT_SIGNAL_EN_R</name>
            <description>Normal Interrupt Signal Enable Register</description>
            <addressOffset>0x38</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FFF</resetMask>
            <fields>
              <field>
                <name>CMD_COMPLETE_SIGNAL_EN</name>
                <description>Command Complete Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>XFER_COMPLETE_SIGNAL_EN</name>
                <description>Transfer Complete Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BGAP_EVENT_SIGNAL_EN</name>
                <description>Block Gap Event Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DMA_INTERRUPT_SIGNAL_EN</name>
                <description>DMA Interrupt Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUF_WR_READY_SIGNAL_EN</name>
                <description>Buffer Write Ready Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUF_RD_READY_SIGNAL_EN</name>
                <description>Buffer Read Ready Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_INSERTION_SIGNAL_EN</name>
                <description>Card Insertion Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_REMOVAL_SIGNAL_EN</name>
                <description>Card Removal Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_INTERRUPT_SIGNAL_EN</name>
                <description>Card Interrupt Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_A_SIGNAL_EN</name>
                <description>INT_A (Embedded) Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_B_SIGNAL_EN</name>
                <description>INT_B (Embedded) Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_C_SIGNAL_EN</name>
                <description>INT_C (Embedded) Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RE_TUNE_EVENT_SIGNAL_EN</name>
                <description>Re-Tuning Event (UHS-I only) Signal Enable.
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FX_EVENT_SIGNAL_EN</name>
                <description>FX Event Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CQE_EVENT_SIGNAL_EN</name>
                <description>Command Queuing Engine Event Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ERROR_INT_SIGNAL_EN_R</name>
            <description>Error Interrupt Signal Enable Register</description>
            <addressOffset>0x3A</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CMD_TOUT_ERR_SIGNAL_EN</name>
                <description>Command Timeout Error Signal Enable (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_CRC_ERR_SIGNAL_EN</name>
                <description>Command CRC Error Signal Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_END_BIT_ERR_SIGNAL_EN</name>
                <description>Command End Bit Error Signal Enable (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_IDX_ERR_SIGNAL_EN</name>
                <description>Command Index Error Signal Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Error</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_TOUT_ERR_SIGNAL_EN</name>
                <description>Data Timeout Error Signal Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_CRC_ERR_SIGNAL_EN</name>
                <description>Data CRC Error Signal Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_END_BIT_ERR_SIGNAL_EN</name>
                <description>Data End Bit Error Signal Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CUR_LMT_ERR_SIGNAL_EN</name>
                <description>Current Limit Error Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTO_CMD_ERR_SIGNAL_EN</name>
                <description>Auto CMD Error Signal Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADMA_ERR_SIGNAL_EN</name>
                <description>ADMA Error Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TUNING_ERR_SIGNAL_EN</name>
                <description>Tuning Error Signal Enable (UHS-I Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RESP_ERR_SIGNAL_EN</name>
                <description>Response Error Signal Enable (SD Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BOOT_ACK_ERR_SIGNAL_EN</name>
                <description>Boot Acknowledgment Error (eMMC Mode only).
Setting this bit to 1 enables generating interrupt signal when
Boot Acknowledgement Error in Error Interrupt Status
register is set.
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR_SIGNAL_EN1</name>
                <description>N/A</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR_SIGNAL_EN2</name>
                <description>N/A</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR_SIGNAL_EN3</name>
                <description>N/A</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTO_CMD_STAT_R</name>
            <description>Auto CMD Status Register</description>
            <addressOffset>0x3C</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xBF</resetMask>
            <fields>
              <field>
                <name>AUTO_CMD12_NOT_EXEC</name>
                <description>Auto CMD12 Not Executed
If multiple memory block data transfer is not started due to a
command error, this bit is not set because it is not necessary
to issue an Auto CMD12. Setting this bit to 1 means that the
Host Controller cannot issue Auto CMD12 to stop multiple
memory block data transfer, due to some error. If this bit is
set to 1, error status bits (D04-D01) is meaningless.
This bit is set to 0 when Auto CMD Error is generated by
Auto CMD23.
Values:
- 0x1 (TRUE): Not Executed
- 0x0 (FALSE): Executed</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AUTO_CMD_TOUT_ERR</name>
                <description>Auto CMD Timeout Error
This bit is set if no response is returned with 64 SDCLK
cycles from the end bit of the command.
If this bit is set to 1, error status bits (D04-D01) are
meaningless.
Values:
- 0x1 (TRUE): Time out
- 0x0 (FALSE): No Error</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AUTO_CMD_CRC_ERR</name>
                <description>Auto CMD CRC Error
This bit is set when detecting a CRC error in the command
response.
Values:
- 0x1 (TRUE): CRC Error Generated
- 0x0 (FALSE): No Error</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AUTO_CMD_EBIT_ERR</name>
                <description>Auto CMD End Bit Error
This bit is set when detecting that the end bit of command
response is 0.
Values:
- 0x1 (TRUE): End Bit Error Generated
- 0x0 (FALSE): No Error</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AUTO_CMD_IDX_ERR</name>
                <description>Auto CMD Index Error
This bit is set if the command index error occurs in response
to a command.
Values:
- 0x1 (TRUE): Error
- 0x0 (FALSE): No Error</description>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AUTO_CMD_RESP_ERR</name>
                <description>Auto CMD Response Error
This bit is set when Response Error Check Enable in the
Transfer Mode register is set to 1 and an error is detected in
R1 response of either Auto CMD12 or CMD13. This status is
ignored if any bit between D00 to D04 is set to 1.
Values:
- 0x1 (TRUE): Error
- 0x0 (FALSE): No Error</description>
                <bitRange>[5:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CMD_NOT_ISSUED_AUTO_CMD12</name>
                <description>Command Not Issued By Auto CMD12 Error
If this bit is set to 1, CMD_wo_DAT is not executed due to an
Auto CMD12 Error (D04-D01) in this register.
This bit is set to 0 when Auto CMD Error is generated by
Auto CMD23.
Values:
- 0x1 (TRUE): Not Issued
- 0x0 (FALSE): No Error</description>
                <bitRange>[7:7]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HOST_CTRL2_R</name>
            <description>Host Control 2 Register</description>
            <addressOffset>0x3E</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFDFF</resetMask>
            <fields>
              <field>
                <name>UHS_MODE_SEL</name>
                <description>N/A</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SIGNALING_EN</name>
                <description>1.8V Signaling Enable
This bit controls voltage regulator for I/O cell in SD UHS-I mode. Setting this bit from 0 to 1 starts changing the
signal voltage from 3.3V to 1.8V. Host Controller clears this
bit if switching to 1.8V signaling fails per protocol. The value is reflected on the io_volt_sel output which can then be used to change an external regulator to supply 1.8V instead of 3.3V on the VDDIO pin associated with the CLK/CMD/DAT signals.
Note: This bit must be set for all UHS-I speed modes
(SDR12/SDR25/SDR50/SDR104/DDR50).
Values:
- 0x0 (V_3_3): 3.3V Signalling
- 0x1 (V_1_8): 1.8V Signalling</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DRV_STRENGTH_SEL</name>
                <description>Driver Strength Select
These bits are used to select the Host Controller output driver in
1.8V signaling UHS-I/eMMC speed modes. They depend
on setting of Preset Value Enable. The value is reflected on
the io_drive_strength[1:0] output.
- 0x0 (TYPEB): Driver TYPEB is selected
- 0x1 (TYPEA): Driver TYPEA is selected
- 0x2 (TYPEC): Driver TYPEC is selected
- 0x3 (TYPED): Driver TYPED is selected</description>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EXEC_TUNING</name>
                <description>Execute Tuning
This bit is set to 1 to start the tuning procedure in UHSI/
eMMC speed modes and this bit is automatically cleared
when tuning procedure is completed.This bit is irrelevant in
UHS-II mode
Values:
- 0x0 (FALSE): Not Tuned or Tuning completed
- 0x1 (TRUE): Execute Tuning</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SAMPLE_CLK_SEL</name>
                <description>Sampling Clock Select
This bit is used by the Host Controller to select the sampling
clock in SD/eMMC mode to receive CMD and DAT. This bit is
set by the tuning procedure and is valid after the completion
of tuning (when Execute Tuning is cleared). Setting this bit to
1 means that tuning is completed successfully and setting
this bit to 0 means that tuning has failed. The value is
reflected on the sample_cclk_sel pin.This bit is irrelevant in
UHS-II mode
Values:
- 0x0 (FALSE): Fixed clock is used to sample data
- 0x1 (TRUE): Tuned clock is used to sample data</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>UHS2_IF_ENABLE</name>
                <description>UHS-II Interface Enable
This bit is used to enable the UHS-II Interface. The value is
reflected on the uhs2_if_en pin.
Values:
- 0x0 (FALSE): SD/eMMC Interface Enabled
- 0x1 (TRUE): UHS-II Interface Enabled</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADMA2_LEN_MODE</name>
                <description>ADMA2 Length Mode
This bit selects ADMA2 Length mode to be either 16-bit or
26-bit.
Values:
- 0x0 (FALSE): 16-bit Data Length Mode
- 0x1 (TRUE): 26-bit Data Length Mode</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD23_ENABLE</name>
                <description>CMD23 Enable
If the card supports CMD23, this bit is set to 1. This bit is
used to select Auto CMD23 or Auto CMD12 for ADMA3 data
transfer.
Values:
- 0x0 (FALSE): Auto CMD23 is disabled
- 0x1 (TRUE): Auto CMD23 is enabled</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HOST_VER4_ENABLE</name>
                <description>Host Version 4 Enable
This bit selects either Version 3.00 compatible mode or
Version 4 mode.
Functions of following fields are modified for Host Version 4
mode:
- SDMA Address: SDMA uses ADMA System Address
(05Fh-058h) instead of SDMA System Address register
(003h-000h)
- ADMA2/ADMA3 selection: ADMA3 is selected by DMA
select in Host Control 1 register
- 64-bit ADMA Descriptor Size: 128-bit descriptor is used
instead of 96-bit descriptor when 64-bit Addressing is set
to 1
- Selection of 32-bit/64-bit System Addressing: Either 32-
bit or 64-bit system addressing is selected by 64-bit
Addressing bit in this register
- 32-bit Block Count: SDMA System Address register
(003h-000h) is modified to 32-bit Block Count register
Note: It is recommended not to program ADMA3 Integrated
Descriptor Address registers, UHS-II registers and
Command Queuing registers (if applicable) while operating
in Host version less than 4 mode (Host Version 4 Enable =
0).
Values:
- 0x0 (FALSE): Version 3.00 compatible mode
- 0x1 (TRUE): Version 4 mode</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADDRESSING</name>
                <description>64-bit Addressing
This bit is effective when Host Version 4 Enable is set to 1.
Values:
- 0x0 (FALSE): 32 bits addressing
- 0x1 (TRUE): 64 bits addressing</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ASYNC_INT_ENABLE</name>
                <description>Asynchronous Interrupt Enable
This bit can be set if a card supports asynchronous
interrupts and Asynchronous Interrupt Support is set to 1 in
the Capabilities register.
Values:
- 0x0 (FALSE): Disabled
- 0x1 (TRUE): Enabled</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PRESET_VAL_ENABLE</name>
                <description>Preset Value Enable
This bit enables automatic selection of SDCLK frequency
and Driver strength Preset Value registers. When Preset
Value Enable is set, SDCLK frequency generation
(Frequency Select and Clock Generator Select) and the
driver strength selection are performed by the controller.
These values are selected from set of Preset Value registers
based on selected speed mode.
Note: For more information, see the FAQ on Preset Register
in the DWC_mshc Databook.
Values:
- 0x0 (FALSE): SDCLK and Driver Strength are controlled
by Host Driver
- 0x1 (TRUE): Automatic Selection by Preset Value are
Enabled</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
