cypress/pdl/devices/psoc6/svd/psoc6a2m.svd
          <register>
            <name>CAPABILITIES1_R</name>
            <description>Capabilities 1 Register - 0 to 31</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x276C6481</resetValue>
            <resetMask>0xFFEFFFBF</resetMask>
            <fields>
              <field>
                <name>TOUT_CLK_FREQ</name>
                <description>Timeout Clock Frequency
This bit shows the base clock frequency used to detect Data
Timeout Error. The Timeout Clock unit defines the unit of
timeout clock frequency. It can be KHz or MHz.
- 0x00 - Get information through another method
- 0x01 - 1KHz / 1MHz
- 0x02 - 2KHz / 2MHz
- 0x03 - 3KHz / 3MHz
- ...........
- 0x3F - 63KHz / 63MHz</description>
                <bitRange>[5:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TOUT_CLK_UNIT</name>
                <description>Timeout Clock Unit
This bit shows the unit of base clock frequency used to
detect Data TImeout Error.
Values:
- 0x0 (KHZ): KHz
- 0x1 (MHZ): MHz</description>
                <bitRange>[7:7]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BASE_CLK_FREQ</name>
                <description>Base Clock Frequency for SD clock
These bits indicate the base (maximum) clock frequency for
the SD Clock. The definition of these bits depend on the Host
Controller Version.
- 6-Bit Base Clock Frequency: This mode is supported by
the Host Controller version 1.00 and 2.00. The upper 2
bits are not effective and are always 0. The unit values
are 1 MHz. The supported clock range is 10 MHz to 63
MHz.
- 0x00 - Get information through another method
- 0x01 - 1 MHz
- 0x02 - 2 MHz
- .............
- 0x3F - 63 MHz
- 0x40-0xFF - Not Supported
- 8-Bit Base Clock Frequency: This mode is supported by
the Host Controller version 3.00. The unit values are 1
MHz. The supported clock range is 10 MHz to 255 MHz.
- 0x00 - Get information through another method
- 0x01 - 1 MHz
- 0x02 - 2 MHz
- ............
- 0xFF - 255 MHz
If the frequency is 16.5 MHz, the larger value is set to
0001001b (17 MHz) because the Host Driver uses this value
to calculate the clock divider value and it does not exceed
the upper limit of the SD Clock frequency. If these bits are all
0, the Host system has to get information using a different
method.</description>
                <bitRange>[15:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>MAX_BLK_LEN</name>
                <description>N/A</description>
                <bitRange>[17:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>EMBEDDED_8_BIT</name>
                <description>8-bit Support for Embedded Device
This bit indicates whether the Host Controller is capable of
using an 8-bit bus width mode. This bit is not effective when
the Slot Type is set to 10b.
Values:
- 0x0 (FALSE): 8-bit Bus Width not Supported
- 0x1 (TRUE): 8-bit Bus Width Supported</description>
                <bitRange>[18:18]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ADMA2_SUPPORT</name>
                <description>ADMA2 Support
This bit indicates whether the Host Controller is capable of
using ADMA2.
Values:
- 0x0 (FALSE): ADMA2 not Supported
- 0x1 (TRUE): ADMA2 Supported</description>
                <bitRange>[19:19]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HIGH_SPEED_SUPPORT</name>
                <description>High Speed Support
This bit indicates whether the Host Controller and the Host
System supports High Speed mode and they can supply the
SD Clock frequency from 25 MHz to 50 MHz.
Values:
- 0x0 (FALSE): High Speed not Supported
- 0x1 (TRUE): High Speed Supported</description>
                <bitRange>[21:21]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SDMA_SUPPORT</name>
                <description>SDMA Support
This bit indicates whether the Host Controller is capable of
using SDMA to transfer data between the system memory
and the Host Controller directly.
Values:
- 0x0 (FALSE): SDMA not Supported
- 0x1 (TRUE): SDMA Supported</description>
                <bitRange>[22:22]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SUS_RES_SUPPORT</name>
                <description>Suspense/Resume Support
This bit indicates whether the Host Controller supports
Suspend/Resume functionality. If this bit is 0, the Host Driver
does not issue either Suspend or Resume commands
because the Suspend and Resume mechanism is not
supported.
Values:
- 0x0 (FALSE): Not Supported
- 0x1 (TRUE): Supported</description>
                <bitRange>[23:23]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>VOLT_33</name>
                <description>Voltage Support 3.3V
Values:
- 0x0 (FALSE): 3.3V Not Supported
- 0x1 (TRUE): 3.3V Supported</description>
                <bitRange>[24:24]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>VOLT_30</name>
                <description>Voltage Support 3.0V
Values:
- 0x0 (FALSE): 3.0V Not Supported
- 0x1 (TRUE): 3.0V Supported</description>
                <bitRange>[25:25]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>VOLT_18</name>
                <description>Voltage Support 1.8V
Values:
- 0x0 (FALSE): 1.8V Not Supported
- 0x1 (TRUE): 1.8V Supported</description>
                <bitRange>[26:26]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SYS_ADDR_64_V4</name>
                <description>64-bit System Address Support for V4
This bit sets the Host Controller to support 64-bit System
Addressing of V4 mode. When this bit is set to 1, full or part
of 64-bit address must be used to decode the Host Controller
Registers so that Host Controller Registers can be placed
above system memory area. 64-bit address decode of Host
Controller registers is effective regardless of setting to 64-bit
Addressing in Host Control 2.
If this bit is set to 1, 64-bit DMA Addressing for version 4 is
enabled by setting Host Version 4 Enable
(HOST_VER4_ENABLE = 1) and by setting 64-bit
Addressing (ADDRESSING =1) in the Host Control 2
register. SDMA can be used and ADMA2 uses 128-bit
Descriptor.
Values:
- 0x0 (FALSE): 64-bit System Address for V4 is Not
Supported
- 0x1 (TRUE): 64-bit System Address for V4 is Supported</description>
                <bitRange>[27:27]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SYS_ADDR_64_V3</name>
                <description>64-bit System Address Support for V3
This bit sets the Host controller to support 64-bit System
Addressing of V3 mode.
SDMA cannot be used in 64-bit Addressing in Version 3
Mode.
If this bit is set to 1, 64-bit ADMA2 with using 96-bit
Descriptor can be enabled by setting Host Version 4 Enable
(HOST_VER4_ENABLE = 0) and DMA select (DMA_SEL =
11b).
Values:
- 0x0 (FALSE): 64-bit System Address for V3 is Not
Supported
- 0x1 (TRUE): 64-bit System Address for V3 is Supported</description>
                <bitRange>[28:28]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ASYNC_INT_SUPPORT</name>
                <description>Asynchronous Interrupt Support (SD Mode only)
Values:
- 0x0 (FALSE): Asynchronous Interrupt Not Supported
- 0x1 (TRUE): Asynchronous Interrupt Supported</description>
                <bitRange>[29:29]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SLOT_TYPE_R</name>
                <description>Slot Type
These bits indicate usage of a slot by a specific Host
System.
Values:
- 0x0 (REMOVABLE_SLOT): Removable Card Slot
- 0x1 (EMBEDDED_SLOT): Embedded Slot for one Device
- 0x2 (SHARED_SLOT): Shared Bus Slot (SD mode)
- 0x3 (UHS2_EMBEDDED_SLOT): UHS-II Multiple
Embedded Devices</description>
                <bitRange>[31:30]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CAPABILITIES2_R</name>
            <description>Capabilities Register - 32 to 63</description>
            <addressOffset>0x44</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x8000077</resetValue>
            <resetMask>0x18FFEF7F</resetMask>
            <fields>
              <field>
                <name>SDR50_SUPPORT</name>
                <description>SDR50 Support (UHS-I only)
Thsi bit indicates that SDR50 is supported. The bit 13
(USE_TUNING_SDR50) indicates whether SDR50 requires
tuning or not.
Values:
- 0x0 (FALSE): SDR50 is not supported
- 0x1 (TRUE): SDR50 is supported</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SDR104_SUPPORT</name>
                <description>SDR104 Support (UHS-I only)
This bit mentions that SDR104 requires tuning.
Values:
- 0x0 (FALSE): SDR104 is not supported
- 0x1 (TRUE): SDR104 is supported</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DDR50_SUPPORT</name>
                <description>DDR50 Support (UHS-I only)
Values:
- 0x0 (FALSE): DDR50 is not supported
- 0x1 (TRUE): DDR50 is supported</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>UHS2_SUPPORT</name>
                <description>UHS-II Support (UHS-II only)
This bit indicates whether Host Controller supports UHS-II.
Values:
- 0x0 (FALSE): UHS-II is not supported
- 0x1 (TRUE): UHS-II is supported</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DRV_TYPEA</name>
                <description>Driver Type A Support (UHS-I only)
This bit indicates support of Driver Type A for 1.8 Signaling.
Values:
- 0x0 (FALSE): Driver Type A is not supported
- 0x1 (TRUE): Driver Type A is supported</description>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DRV_TYPEC</name>
                <description>Driver Type C Support (UHS-I only)
This bit indicates support of Driver Type C for 1.8 Signaling.
Values:
- 0x0 (FALSE): Driver Type C is not supported
- 0x1 (TRUE): Driver Type C is supported</description>
                <bitRange>[5:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DRV_TYPED</name>
                <description>Driver Type D Support (UHS-I only)
This bit indicates support of Driver Type D for 1.8 Signaling.
Values:
- 0x0 (FALSE): Driver Type D is not supported
- 0x1 (TRUE): Driver Type D is supported</description>
                <bitRange>[6:6]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RETUNE_CNT</name>
                <description>N/A</description>
                <bitRange>[11:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>USE_TUNING_SDR50</name>
                <description>Use Tuning for SDR50 (UHS-I only)
Values:
- 0x0 (ZERO): SDR50 does not require tuning
- 0x1 (ONE): SDR50 requires tuning</description>
                <bitRange>[13:13]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RE_TUNING_MODES</name>
                <description>N/A</description>
                <bitRange>[15:14]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CLK_MUL</name>
                <description>Clock Multiplier
These bits indicate the clock multiplier of the programmable
clock generator. Setting these bits to 0 means that the Host
Controller does not support a programmable clock generator.
- 0x0: Clock Multiplier is not Supported
- 0x1: Clock Multiplier M = 2
- 0x2: Clock Multiplier M = 3
- .........
- 0xFF: Clock Multiplier M = 256</description>
                <bitRange>[23:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ADMA3_SUPPORT</name>
                <description>ADMA3 Support
This bit indicates whether the Host Controller is capable of
using ADMA3.
Values:
- 0x0 (FALSE): ADMA3 not Supported
- 0x1 (TRUE): ADMA3 Supported</description>
                <bitRange>[27:27]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>VDD2_18V_SUPPORT</name>
                <description>1.8V VDD2 Support
This bit indicates support of VDD2 for the Host System.
Values:
- 0x0 (FALSE): 1.8V VDD2 is not Supported
- 0x1 (TRUE): 1.8V VDD2 is Supported</description>
                <bitRange>[28:28]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CURR_CAPABILITIES1_R</name>
            <description>Current Capabilities Register - 0 to 31</description>
            <addressOffset>0x48</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFF</resetMask>
            <fields>
              <field>
                <name>MAX_CUR_33V</name>
                <description>Maximum Current for 3.3V
This bit specifies the Maximum Current for 3.3V VDD1 power
supply for the card.
- 0: Get information through another method
- 1: 4mA
- 2: 8mA
- 3: 13mA
- .......
- 255: 1020mA</description>
                <bitRange>[7:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>MAX_CUR_30V</name>
                <description>Maximum Current for 3.0V
This bit specifies the Maximum Current for 3.0V VDD1 power
supply for the card.
- 0: Get information through another method
- 1: 4mA
- 2: 8mA
- 3: 13mA
- .......
- 255: 1020mA</description>
                <bitRange>[15:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>MAX_CUR_18V</name>
                <description>Maximum Current for 1.8V
This bit specifies the Maximum Current for 1.8V VDD1 power
supply for the card.
- 0: Get information through another method
- 1: 4mA
- 2: 8mA
- 3: 13mA
- .......
- 255: 1020mA</description>
                <bitRange>[23:16]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CURR_CAPABILITIES2_R</name>
            <description>Maximum Current Capabilities Register - 32 to 63</description>
            <addressOffset>0x4C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>MAX_CUR_VDD2_18V</name>
                <description>Maximum Current for 1.8V VDD2
This bit specifies the Maximum Current for 1.8V VDD2 power
supply for the UHS-II card.
- 0: Get information through another method
- 1: 4mA
- 2: 8mA
- 3: 13mA
- .......
- 255: 1020mA</description>
                <bitRange>[7:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCE_AUTO_CMD_STAT_R</name>
            <description>Force Event Register for Auto CMD Error Status register</description>
            <addressOffset>0x50</addressOffset>
            <size>16</size>
            <access>write-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xBF</resetMask>
            <fields>
              <field>
                <name>FORCE_AUTO_CMD12_NOT_EXEC</name>
                <description>Force Event for Auto CMD12 Not Executed
Values:
- 0x1 (TRUE): Auto CMD12 Not Executed Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[0:0]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCE_AUTO_CMD_TOUT_ERR</name>
                <description>Force Event for Auto CMD Timeout Error
Values:
- 0x1 (TRUE): Auto CMD Timeout Error Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[1:1]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCE_AUTO_CMD_CRC_ERR</name>
                <description>Force Event for Auto CMD CRC Error
Values:
- 0x1 (TRUE): Auto CMD CRC Error Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[2:2]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCE_AUTO_CMD_EBIT_ERR</name>
                <description>Force Event for Auto CMD End Bit Error
Values:
- 0x1 (TRUE): Auto CMD End Bit Error Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[3:3]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCE_AUTO_CMD_IDX_ERR</name>
                <description>Force Event for Auto CMD Index Error
Values:
- 0x1 (TRUE): Auto CMD Index Error Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[4:4]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCE_AUTO_CMD_RESP_ERR</name>
                <description>Force Event for Auto CMD Response Error
Values:
- 0x1 (TRUE): Auto CMD Response Error Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[5:5]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>FORCE_CMD_NOT_ISSUED_AUTO_CMD12</name>
                <description>Force Event for Command Not Issued By Auto CMD12 Error
Values:
- 0x1 (TRUE): Command Not Issued By Auto CMD12 Error
Status is set
- 0x0 (FALSE): Not Affected</description>
                <bitRange>[7:7]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
