cypress/pdl/devices/psoc6/svd/psoc6a2m.svd
          <register>
            <name>FORCE_ERROR_INT_STAT_R</name>
            <description>Force Event Register for Error Interrupt Status</description>
            <addressOffset>0x52</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>FORCE_CMD_TOUT_ERR</name>
                <description>Force Event for Command Timeout Error (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Command Timeout Error Status is set</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_CMD_CRC_ERR</name>
                <description>Force Event for Command CRC Error (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Command CRC Error Status is set</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_CMD_END_BIT_ERR</name>
                <description>Force Event for Command End Bit Error (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Command End Bit Error Status is set</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_CMD_IDX_ERR</name>
                <description>Force Event for Command Index Error (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Command Index Error Status is set</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_DATA_TOUT_ERR</name>
                <description>Force Event for Data Timeout Error (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Data Timeout Error Status is set</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_DATA_CRC_ERR</name>
                <description>Force Event for Data CRC Error (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Data CRC Error Status is set</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_DATA_END_BIT_ERR</name>
                <description>Force Event for Data End Bit Error (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Data End Bit Error Status is set</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_CUR_LMT_ERR</name>
                <description>Force Event for Current Limit Error
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Current Limit Error Status is set</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_AUTO_CMD_ERR</name>
                <description>Force Event for Auto CMD Error (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Auto CMD Error Status is set</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_ADMA_ERR</name>
                <description>Force Event for ADMA Error
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): ADMA Error Status is set</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_TUNING_ERR</name>
                <description>Force Event for Tuning Error (UHS-I Mode only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Tuning Error Status is set</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_RESP_ERR</name>
                <description>Force Event for Response Error (SD Mode only)
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Response Error Status is set</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_BOOT_ACK_ERR</name>
                <description>Force Event for Boot Ack error
Values:
- 0x0 (FALSE): Not Affected
- 0x1 (TRUE): Boot ack Error Status is set</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_VENDOR_ERR1</name>
                <description>N/A</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_VENDOR_ERR2</name>
                <description>N/A</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_VENDOR_ERR3</name>
                <description>N/A</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADMA_ERR_STAT_R</name>
            <description>ADMA Error Status Register</description>
            <addressOffset>0x54</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>ADMA_ERR_STATES</name>
                <description>ADMA Error States
These bits indicate the state of ADMA when an error occurs
during ADMA data transfer.
Values:
- 0x0 (ST_STOP): Stop DMA - SYS_ADR register points to
a location next to the error descriptor
- 0x1 (ST_FDS): Fetch Descriptor - SYS_ADR register
points to the error descriptor
- 0x2 (UNUSED): Never set this state
- 0x3 (ST_TFR): Transfer Data - SYS_ADR register points
to a location next to the error descriptor</description>
                <bitRange>[1:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ADMA_LEN_ERR</name>
                <description>ADMA Length Mismatch Error States
This error occurs in the following instances:
- While the Block Count Enable is being set, the total data
length specified by the Descriptor table is different from
that specified by the Block Count and Block Length
- When the total data length cannot be divided by the block
length
Values:
- 0x0 (NO_ERR): No Error
- 0x1 (ERROR): Error</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADMA_SA_LOW_R</name>
            <description>ADMA System Address Register - Low</description>
            <addressOffset>0x58</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADMA_SA_LOW</name>
                <description>ADMA System Address
These bits indicate the lower 32 bits of the ADMA system
address.
- SDMA: If Host Version 4 Enable is set to 1, this register
stores the system address of the data location
- ADMA2: This register stores the byte address of the
executing command of the descriptor table
- ADMA3: This register is set by ADMA3. ADMA2
increments the address of this register that points to the
next line, every time a Descriptor line is fetched.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESET_INIT_R</name>
            <description>Preset Value for Initialization</description>
            <addressOffset>0x60</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xC7FF</resetMask>
            <fields>
              <field>
                <name>FREQ_SEL_VAL</name>
                <description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency
Select field of the Clock Control register described by a Host
System.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CLK_GEN_SEL_VAL</name>
                <description>Clock Generator Select Value
This bit is effective when the Host Controller supports a
programmable clock generator.
Values:
- 0x0 (FALSE): Host Controller Ver2.0 Compatible Clock
Generator
- 0x1 (PROG): Programmable Clock Generator</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DRV_SEL_VAL</name>
                <description>Driver Strength Select Value
These bits indicate that the Driver strength is supported by
1.8V signaling bus speed modes. These bits are
meaningless for 3.3V signaling.
Values:
- 0x0 (TYPEB): Driver Type B is selected
- 0x1 (TYPEA): Driver Type A is selected
- 0x2 (TYPEC): Driver Type C is selected
- 0x3 (TYPED): Driver Type D is selected</description>
                <bitRange>[15:14]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESET_DS_R</name>
            <description>Preset Value for Default Speed</description>
            <addressOffset>0x62</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xC7FF</resetMask>
            <fields>
              <field>
                <name>FREQ_SEL_VAL</name>
                <description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency
Select field of the Clock Control register described by a Host
System.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CLK_GEN_SEL_VAL</name>
                <description>Clock Generator Select Value
This bit is effective when Host Controller supports
programmable clock generator.
Values:
- 0x0 (FALSE): Host Controller Ver2.0 Compatible Clock
Generator
- 0x1 (PROG): Programmable Clock Generator</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DRV_SEL_VAL</name>
                <description>Driver Strength Select Value
These bits indicate the Driver strength value supported by
1.8V signaling bus speed modes. This field is meaningless
for the Default speed mode as it uses 3.3V signaling.
Values:
- 0x0 (TYPEB): Driver Type B is selected
- 0x1 (TYPEA): Driver Type A is selected
- 0x2 (TYPEC): Driver Type C is selected
- 0x3 (TYPED): Driver Type D is selected</description>
                <bitRange>[15:14]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESET_HS_R</name>
            <description>Preset Value for High Speed</description>
            <addressOffset>0x64</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xC7FF</resetMask>
            <fields>
              <field>
                <name>FREQ_SEL_VAL</name>
                <description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency
Select field of the Clock Control register described by a Host
System.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CLK_GEN_SEL_VAL</name>
                <description>Clock Generator Select Value
This bit is effective when Host Controller supports
programmable clock generator.
Values:
- 0x0 (FALSE): Host Controller Ver2.0 Compatible Clock
Generator
- 0x1 (PROG): Programmable Clock Generator</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DRV_SEL_VAL</name>
                <description>Driver Strength Select Value
These bits indicate the Driver strength value supported by
1.8V signaling bus speed modes. This field is meaningless
for High speed mode as it uses 3.3V signaling.
Values:
- 0x0 (TYPEB): Driver Type B is selected
- 0x1 (TYPEA): Driver Type A is selected
- 0x2 (TYPEC): Driver Type C is selected
- 0x3 (TYPED): Driver Type D is selected</description>
                <bitRange>[15:14]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESET_SDR12_R</name>
            <description>Preset Value for SDR12</description>
            <addressOffset>0x66</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xC7FF</resetMask>
            <fields>
              <field>
                <name>FREQ_SEL_VAL</name>
                <description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency
Select field of the Clock Control register described by a Host
System.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CLK_GEN_SEL_VAL</name>
                <description>Clock Generator Select Value
This bit is effective when Host Controller supports
programmable clock generator
Values:
- 0x0 (FALSE): Host Controller Ver2.0 Compatible Clock
Generator
- 0x1 (PROG): Programmable Clock Generator</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DRV_SEL_VAL</name>
                <description>Driver Strength Select Value
These bits indicate the Driver strength value supported for
the SDR12 bus speed mode. These bits are meaningless for
3.3V signaling.
Values:
- 0x0 (TYPEB): Driver Type B is selected
- 0x1 (TYPEA): Driver Type A is selected
- 0x2 (TYPEC): Driver Type C is selected
- 0x3 (TYPED): Driver Type D is selected</description>
                <bitRange>[15:14]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESET_SDR25_R</name>
            <description>Preset Value for SDR25</description>
            <addressOffset>0x68</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xC7FF</resetMask>
            <fields>
              <field>
                <name>FREQ_SEL_VAL</name>
                <description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency
Select field of the Clock Control register described by a Host
System.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CLK_GEN_SEL_VAL</name>
                <description>Clock Generator Select Value
This bit is effective when Host Controller supports
programmable clock generator.
Values:
- 0x0 (FALSE): Host Controller Ver2.0 Compatible Clock
Generator
- 0x1 (PROG): Programmable Clock Generator</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DRV_SEL_VAL</name>
                <description>Driver Strength Select Value
These bits indicate the Driver strength value supported for
the SDR12 bus speed mode. These bits are meaningless for
3.3V signaling.
Values:
- 0x0 (TYPEB): Driver Type B is selected
- 0x1 (TYPEA): Driver Type A is selected
- 0x2 (TYPEC): Driver Type C is selected
- 0x3 (TYPED): Driver Type D is selectedDriver Strength Select Value
These bits indicate the Driver strength value supported for
the SDR25 bus speed mode. These bits are meaningless for
3.3V signaling.
Values:
- 0x0 (TYPEB): Driver Type B is selected
- 0x1 (TYPEA): Driver Type A is selected
- 0x2 (TYPEC): Driver Type C is selected
- 0x3 (TYPED): Driver Type D is selected</description>
                <bitRange>[15:14]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESET_SDR50_R</name>
            <description>Preset Value for SDR50</description>
            <addressOffset>0x6A</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xC7FF</resetMask>
            <fields>
              <field>
                <name>FREQ_SEL_VAL</name>
                <description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency
Select field of the Clock Control register described by a Host
System.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CLK_GEN_SEL_VAL</name>
                <description>Clock Generator Select Value
This bit is effective when Host Controller supports
programmable clock generator.
Values:
- 0x0 (FALSE): Host Controller Ver2.0 Compatible Clock
Generator
- 0x1 (PROG): Programmable Clock Generator</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DRV_SEL_VAL</name>
                <description>Driver Strength Select Value
These bits indicate Driver strength value supported for
SDR50 bus speed mode. These bits are meaningless for
3.3V signaling.
Values:
- 0x0 (TYPEB): Driver Type B is selected
- 0x1 (TYPEA): Driver Type A is selected
- 0x2 (TYPEC): Driver Type C is selected
- 0x3 (TYPED): Driver Type D is selected</description>
                <bitRange>[15:14]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESET_SDR104_R</name>
            <description>Preset Value for SDR104</description>
            <addressOffset>0x6C</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xC7FF</resetMask>
            <fields>
              <field>
                <name>FREQ_SEL_VAL</name>
                <description>SDCLK/RCLK Frequency Select Value
These bits specify a 10-bit preset value that must be set in
the SDCLK/RCLK Frequency Select field of the Clock
Control register described by a Host System.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CLK_GEN_SEL_VAL</name>
                <description>Clock Generator Select Value
This bit is effective when Host Controller supports
programmable clock generator.
Values:
- 0x0 (FALSE): Host Controller Ver2.0 Compatible Clock
Generator
- 0x1 (PROG): Programmable Clock Generator</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DRV_SEL_VAL</name>
                <description>Driver Strength Select Value
These bits indicate Driver strength value supported for
SDR104 bus speed mode. These bits are meaningless for
3.3V signaling.
Values:
- 0x0 (TYPEB): Driver Type B is selected
- 0x1 (TYPEA): Driver Type A is selected
- 0x2 (TYPEC): Driver Type C is selected
- 0x3 (TYPED): Driver Type D is selected</description>
                <bitRange>[15:14]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESET_DDR50_R</name>
            <description>Preset Value for DDR50</description>
            <addressOffset>0x6E</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xC7FF</resetMask>
            <fields>
              <field>
                <name>FREQ_SEL_VAL</name>
                <description>SDCLK/RCLK Frequency Select Value
These bits specify a 10-bit preset value that must be set in
the SDCLK/RCLK Frequency Select field of the Clock
Control register, as described by a Host System.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CLK_GEN_SEL_VAL</name>
                <description>Clock Generator Select Value
This bit is effective when Host Controller supports
programmable clock generator.
Values:
- 0x0 (FALSE): Host Controller Ver2.0 Compatible Clock
Generator
- 0x1 (PROG): Programmable Clock Generator</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DRV_SEL_VAL</name>
                <description>Driver Strength Select Value
These bits indicate Driver strength value supported for
DDR50 bus speed mode. These bits are meaningless for
3.3V signaling.
Values:
- 0x0 (TYPEB): Driver Type B is selected
- 0x1 (TYPEA): Driver Type A is selected
- 0x2 (TYPEC): Driver Type C is selected
- 0x3 (TYPED): Driver Type D is selected</description>
                <bitRange>[15:14]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
