cypress/pdl/devices/psoc6/svd/psoc6a2m.svd
          <register>
            <name>PRESET_UHS2_R</name>
            <description>Preset Value for UHS-II</description>
            <addressOffset>0x74</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xC7FF</resetMask>
            <fields>
              <field>
                <name>FREQ_SEL_VAL</name>
                <description>SDCLK/RCLK Frequency Select Value
These bits specify the 10-bit preset value that must be set in
the SDCLK/RCLK Frequency Select field of the Clock
Control register, as described by a Host System.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CLK_GEN_SEL_VAL</name>
                <description>Clock Generator Select Value
This bit is effective when the Host Controller supports a
programmable clock generator.
Values:
- 0x0 (FALSE): Host Controller Ver2.0 Compatible Clock
Generator
- 0x1 (PROG): Programmable Clock Generator</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DRV_SEL_VAL</name>
                <description>Driver Strength Select Value
These bits indicate the Driver strength value supported by
1.8V signaling bus speed modes in the SD mode. This field
is meaningless for UHS-II mode. In eMMC mode, these bits
can be used for selecting the Drive strength value for HS400
mode.
Values:
- 0x0 (TYPEB): Driver Type B is selected
- 0x1 (TYPEA): Driver Type A is selected
- 0x2 (TYPEC): Driver Type C is selected
- 0x3 (TYPED): Driver Type D is selected</description>
                <bitRange>[15:14]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADMA_ID_LOW_R</name>
            <description>ADMA3 Integrated Descriptor Address Register - Low</description>
            <addressOffset>0x78</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADMA_ID_LOW</name>
                <description>ADMA Integrated Descriptor Address
These bits indicate the lower 32-bit of the ADMA Integrated
Descriptor address. The start address of Integrated
Descriptor is set to these register bits. The ADMA3 fetches
one Descriptor Address and increments these bits to indicate
the next Descriptor address.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>P_EMBEDDED_CNTRL</name>
            <description>Pointer for Embedded Control</description>
            <addressOffset>0xE6</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0xF6C</resetValue>
            <resetMask>0xFFF</resetMask>
            <fields>
              <field>
                <name>REG_OFFSET_ADDR</name>
                <description>Offset Address of Embedded Control register.</description>
                <bitRange>[11:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>P_VENDOR_SPECIFIC_AREA</name>
            <description>Pointer for Vendor Specific Area 1</description>
            <addressOffset>0xE8</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x500</resetValue>
            <resetMask>0xFFF</resetMask>
            <fields>
              <field>
                <name>REG_OFFSET_ADDR</name>
                <description>Base offset Address for Vendor-Specific registers.</description>
                <bitRange>[11:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>P_VENDOR2_SPECIFIC_AREA</name>
            <description>Pointer for Vendor Specific Area 2</description>
            <addressOffset>0xEA</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x180</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>V2SA_REG_OFFSET_ADDR</name>
                <description>Base offset Address for Command Queuing registers.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SLOT_INTR_STATUS_R</name>
            <description>Slot Interrupt Status Register</description>
            <addressOffset>0xFC</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>INTR_SLOT</name>
                <description>Interrupt signal for each Slot
These status bits indicate the logical OR of Interrupt signal
and Wakeup signal for each slot. A maximum of 8 slots can
be defined. If one interrupt signal is associated with multiple
slots, the Host Driver can identify the interrupt that is
generated by reading these bits. By a power on reset or by
setting Software Reset For All bit, the interrupt signals are
de-asserted and this status reads 00h.
- Bit 00: Slot 1
- Bit 01: Slot 2
- Bit 02: Slot 3
- ..........
- ..........
- Bit 07: Slot 8
Note: MSHC Host Controller support single card slot. This
register shall always return 0.</description>
                <bitRange>[7:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HOST_CNTRL_VERS_R</name>
            <description>Host Controller Version</description>
            <addressOffset>0xFE</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x5</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SPEC_VERSION_NUM</name>
                <description>N/A</description>
                <bitRange>[7:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>VENDOR_VERSION_NUM</name>
                <description>N/A</description>
                <bitRange>[15:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQVER</name>
            <description>Command Queuing Version register</description>
            <addressOffset>0x180</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x510</resetValue>
            <resetMask>0xFFF</resetMask>
            <fields>
              <field>
                <name>EMMC_VER_SUFFIX</name>
                <description>This bit indicates the eMMC version suffix (2nd digit right of
decimal point) in BCD format.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>EMMC_VER_MINOR</name>
                <description>This bit indicates the eMMC minor version (1st digit right of
decimal point) in BCD format.</description>
                <bitRange>[7:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>EMMC_VER_MAJOR</name>
                <description>This bit indicates the eMMC major version (1st digit left of
decimal point) in BCD format.</description>
                <bitRange>[11:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQCAP</name>
            <description>Command Queuing Capabilities register</description>
            <addressOffset>0x184</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x30C8</resetValue>
            <resetMask>0x1000F3FF</resetMask>
            <fields>
              <field>
                <name>ITCFVAL</name>
                <description>Internal Timer Clock Frequency Value (ITCFVAL)
This field scales the frequency of the timer clock provided by
ITCFMUL. The Final clock frequency of actual timer clock is
calculated as ITCFVAL* ITCFMUL.</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ITCFMUL</name>
                <description>N/A</description>
                <bitRange>[15:12]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CRYPTO_SUPPORT</name>
                <description>Crypto Support
This bit indicates whether the Host Controller supports
cryptographic operations.
Values:
- 0x0 (FALSE): Crypto not Supported
- 0x1 (TRUE): Crypto Supported</description>
                <bitRange>[28:28]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQCFG</name>
            <description>Command Queuing Configuration register</description>
            <addressOffset>0x188</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1103</resetMask>
            <fields>
              <field>
                <name>CQ_EN</name>
                <description>Enable command queuing engine (CQE).
When CQE is disable, the software controls the eMMC bus
using the registers between the addresses 0x000 to 0x1FF.
Before the software writes to this bit, the software verifies
that the eMMC host controller is in idle state and there are no
ongoing commands or data transfers. When software wants
to exit command queuing mode, it clears all previous tasks (if
any) before setting this bit to 0.
Values:
- 0x1 (CQE_ENABLE): Enable command queuing
- 0x0 (CQE_DISABLE): Disable command queuing</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CR_GENERAL_EN</name>
                <description>N/A</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TASK_DESC_SIZE</name>
                <description>Bit Value Description
This bit indicates the size of task descriptor used in host
memory. This bit can only be configured when Command
Queuing Enable bit is 0 (command queuing is disabled).
Values:
- 0x1 (TASK_DESC_128b): Task descriptor size is 128 bits
- 0x0 (TASK_DESC_64b): Task descriptor size is 64 bits</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DCMD_EN</name>
                <description>This bit indicates to the hardware whether the Task
Descriptor in slot #31 of the TDL is a data transfer descriptor
or a direct-command descriptor. CQE uses this bit when a
task is issued in slot #31, to determine how to decode the
Task Descriptor.
Values:
- 0x1 (SLOT31_DCMD_ENABLE): Task descriptor in slot
#31 is a DCMD Task Descriptor
- 0x0 (SLOT31_DCMD_DISABLE): Task descriptor in slot
#31 is a data Transfer Task Descriptor</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQCTL</name>
            <description>Command Queuing Control register</description>
            <addressOffset>0x18C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x101</resetMask>
            <fields>
              <field>
                <name>HALT</name>
                <description>Halt request and resume
Values:
- 0x1 (HALT_CQE): Software writes 1 to this bit when it
wants to acquire software control over the eMMC bus and
to disable CQE from issuing command on the bus.
For example, issuing a Discard Task command
(CMDQ_TASK_MGMT). When the software writes 1, CQE
completes the ongoing task (if any in progress). After the
task is completed and the CQE is in idle state, CQE does not
issue new commands and indicates to the software by
setting this bit to 1. The software can poll on this bit until it is
set to 1 and only then send commands on the eMMC bus.
- 0x0 (RESUME_CQE): Software writes 0 to this bit to exit
from the halt state and resume CQE activity.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLR_ALL_TASKS</name>
                <description>Clear all tasks
This bit can only be written when the controller is halted. This
bit does not clear tasks in the device. The software has to
use the CMDQ_TASK_MGMT command to clear device's
queue.
Values:
- 0x1 (CLEAR_ALL_TASKS): Clears all the tasks in the
controller
- 0x0 (NO_EFFECT): Programming 0 has no effect</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQIS</name>
            <description>Command Queuing Interrupt Status register</description>
            <addressOffset>0x190</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>HAC</name>
                <description>Halt complete interrupt
This status bit is asserted (only if CQISE.HAC_STE=1) when
halt bit in the CQCTL register transitions from 0 to 1
indicating that the host controller has completed its current
ongoing task and has entered halt state. A value of 1 clears
this status bit.
Values:
- 0x1 (SET): HAC Interrupt is set
- 0x0 (NOTSET): HAC Interrupt is not set</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TCC</name>
                <description>Task complete interrupt
This status bit is asserted (if CQISE.TCC_STE=1) when at
least one of the following conditions are met:
- A task is completed and the INT bit is set in its Task
Descriptor
- Interrupt caused by Interrupt Coalescing logic due to
timeout
- Interrupt Coalescing logic reached the configured
threshold
A value of 1 clears this status bit
Values:
- 0x1 (SET): TCC Interrupt is set
- 0x0 (NOTSET): TCC Interrupt is not set</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RED</name>
                <description>Response error detected interrupt
This status bit is asserted (if CQISE.RED_STE=1) when a
response is received with an error bit set in the device status
field. Configure the CQRMEM register to identify device
status bit fields that may trigger an interrupt and that are
masked. A value of 1 clears this status bit.
Values:
- 0x1 (SET): RED Interrupt is set
- 0x0 (NOTSET): RED Interrupt is not set</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TCL</name>
                <description>Task cleared interrupt
This status bit is asserted (if CQISE.TCL_STE=1) when a
task clear operation is completed by CQE. The completed
task clear operation is either an individual task clear (by
writing CQTCLR) or clearing of all tasks (by writing CQCTL).
A value of 1 clears this status bit.
Values:
- 0x1 (SET): TCL Interrupt is set
- 0x0 (NOTSET): TCL Interrupt is not set</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GCE</name>
                <description>N/A</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ICCE</name>
                <description>N/A</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQISE</name>
            <description>Command Queuing Interrupt Status Enable register</description>
            <addressOffset>0x194</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>HAC_STE</name>
                <description>Halt complete interrupt status enable
Values:
- 0x1 (INT_STS_ENABLE): CQIS.HAC is set when its
interrupt condition is active
- 0x0 (INT_STS_DISABLE): CQIS.HAC is disabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TCC_STE</name>
                <description>Task complete interrupt status enable
Values:
- 0x1 (INT_STS_ENABLE): CQIS.TCC is set when its
interrupt condition is active
- 0x0 (INT_STS_DISABLE): CQIS.TCC is disabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RED_STE</name>
                <description>Response error detected interrupt status enable
Values:
- 0x1 (INT_STS_ENABLE): CQIS.RED is set when its
interrupt condition is active
- 0x0 (INT_STS_DISABLE): CQIS.RED is disabled</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TCL_STE</name>
                <description>Task cleared interrupt status enable
Values:
- 0x1 (INT_STS_ENABLE): CQIS.TCL is set when its
interrupt condition is active
- 0x0 (INT_STS_DISABLE): CQIS.TCL is disabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GCE_STE</name>
                <description>General Crypto Error interrupt status enable
Values:
- 0x1 (INT_STS_ENABLE): CQIS.GCE is set when its
interrupt condition is active
- 0x0 (INT_STS_DISABLE): CQIS.GCE is disabled</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ICCE_STE</name>
                <description>Invalid Crypto Configuration Error interrupt status enable
Values:
- 0x1 (INT_STS_ENABLE): CQIS.ICCE is set when its
interrupt condition is active
- 0x0 (INT_STS_DISABLE): CQIS.ICCE is disabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQISGE</name>
            <description>Command Queuing Interrupt signal enable register</description>
            <addressOffset>0x198</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>HAC_SGE</name>
                <description>Halt complete interrupt signal enable
Values:
- 0x1 (INT_SIG_ENABLE): CQIS.HAC interrupt signal
generation is active
- 0x0 (INT_SIG_DISABLE): CQIS.HAC interrupt signal
generation is disabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TCC_SGE</name>
                <description>Task complete interrupt signal enable
Values:
- 0x1 (INT_SIG_ENABLE): CQIS.TCC interrupt signal
generation is active
- 0x0 (INT_SIG_DISABLE): CQIS.TCC interrupt signal
generation is disabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RED_SGE</name>
                <description>Response error detected interrupt signal enable
Values:
- 0x1 (INT_SIG_ENABLE): CQIS.RED interrupt signal
generation is active
- 0x0 (INT_SIG_DISABLE): CQIS.RED interrupt signal
generation is disabled</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TCL_SGE</name>
                <description>Task cleared interrupt signal enable
Values:
- 0x1 (INT_SIG_ENABLE): CQIS.TCL interrupt signal
generation is active
- 0x0 (INT_SIG_DISABLE): CQIS.TCL interrupt signal
generation is disabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GCE_SGE</name>
                <description>General Crypto Error interrupt signal enable
Values:
- 0x1 (INT_SIG_ENABLE): CQIS.GCE interrupt signal
generation is active
- 0x0 (INT_SIG_DISABLE): CQIS.GCE interrupt signal
generation is disabled</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ICCE_SGE</name>
                <description>Invalid Crypto Configuration Error interrupt signal enable
Values:
- 0x1 (INT_SIG_ENABLE): CQIS.ICCE interrupt signal
generation is active
- 0x0 (INT_SIG_DISABLE): CQIS.ICCE interrupt signal
generation is disabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
