cypress/pdl/devices/psoc6/svd/psoc6a2m.svd
          <register>
            <name>MSHC_VER_TYPE_R</name>
            <description>MSHC version type</description>
            <addressOffset>0x504</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x67612A2A</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MSHC_VER_TYPE</name>
                <description>Current release type
This field indicates the Synopsys DesignWare Cores
DWC_mshc/DWC_mshc_lite current release type that is
read by an application.
For example, release type is 'ga' is represented in ASCII as
0x6761. Lower 16 bits read from this register can be ignored
by the application.
An application reading this register in conjunction with the
MSHC_VER_ID_R register, gathers details of the current
release.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MSHC_CTRL_R</name>
            <description>MSHC Control register</description>
            <addressOffset>0x508</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x1</resetValue>
            <resetMask>0x11</resetMask>
            <fields>
              <field>
                <name>CMD_CONFLICT_CHECK</name>
                <description>Command conflict check
This bit enables command conflict check.
Note: DWC_mshc controller monitors the CMD line
whenever a command is issued and checks whether the
value driven on sd_cmd_out matches the value on
sd_cmd_in at next subsequent edge of cclk_tx to determine
command conflict error. This bit is cleared only if the feed
back delay (including IO Pad delay) is more than
(t_card_clk_period - t_setup), where t_setup is the setup
time of a flop in DWC_mshc. The I/O pad delay is consistent
across CMD and DATA lines, and it is within the value:
(2*t_card_clk_period - t_setup)
Values:
- 0x0 (DISABLE_CMD_CONFLICT_CHK): Disable
command conflict check
- 0x1 (CMD_CONFLICT_CHK_LAT1): Check for command
conflict after 1 card clock cycle</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SW_CG_DIS</name>
                <description>Internal clock gating disable control
This bit must be used to disable IP's internal clock gating
when required. when disabled clocks are not gated. Clocks
to the core (except hclk) must be stopped when
programming this bit.
Values:
- 0x0 (ENABLE): Internal clock gates are active and clock
gating is controlled internally
- 0x1 (DISABLE): Internal clock gating is disabled, clocks
are not gated internally</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MBIU_CTRL_R</name>
            <description>MBIU Control register</description>
            <addressOffset>0x510</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x1</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>UNDEFL_INCR_EN</name>
                <description>Undefined INCR Burst
Controls generation of undefined length INCR transfer on
Master interface.
Values:
- 0x0 (FALSE): Undefined INCR type burst is the least
preferred burst on AHB Master I/F
- 0x1 (TRUE): Undefined INCR type burst is the most
preferred burst on AHB Master I/F</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BURST_INCR4_EN</name>
                <description>INCR4 Burst
Controls generation of INCR4 transfers on Master interface.
Values:
- 0x0 (FALSE): AHB INCR4 burst type is not generated on
Master I/F
- 0x1 (TRUE): AHB INCR4 burst type can be generated on
Master I/F</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BURST_INCR8_EN</name>
                <description>INCR8 Burst
Controls generation of INCR8 transfers on Master interface.
Values:
- 0x0 (FALSE): AHB INCR8 burst type is not generated on
Master I/F
- 0x1 (TRUE): AHB INCR8 burst type can be generated on
Master I/F</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BURST_INCR16_EN</name>
                <description>INCR16 Burst
Controls generation of INCR16 transfers on Master
interface.
Values:
- 0x0 (FALSE): AHB INCR16 burst type is not generated on
Master I/F
- 0x1 (TRUE): AHB INCR16 burst type can be generated
on Master I/F</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EMMC_CTRL_R</name>
            <description>eMMC Control register</description>
            <addressOffset>0x52C</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0xC</resetValue>
            <resetMask>0x60F</resetMask>
            <fields>
              <field>
                <name>CARD_IS_EMMC</name>
                <description>eMMC Card present
This bit indicates the type of card connected. An application
program this bit based on the card connected to MSHC.
Values:
- 0x1 (EMMC_CARD): Card connected to MSHC is an
eMMC card
- 0x0 (NON_EMMC_CARD): Card connected to MSHC is
a non-eMMC card</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DISABLE_DATA_CRC_CHK</name>
                <description>Disable Data CRC Check
This bit controls masking of CRC16 error for Card Write in
eMMC mode. This is useful in bus testing (CMD19) for an
eMMC device. In bus testing, an eMMC card does not send
CRC status for a block, which may generate CRC error. This
CRC error can be masked using this bit during bus testing.
Values:
- 0x1 (DISABLE): DATA CRC check is disabled
- 0x0 (ENABLE): DATA CRC check is enabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EMMC_RST_N</name>
                <description>EMMC Device Reset signal control.
This register field controls the sd_rst_n output of DWC_mshc
Values:
- 0x1 (RST_DEASSERT): Reset to eMMC device is
deasserted
- 0x0 (RST_ASSERT): Reset to eMMC device asserted
(active low)</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EMMC_RST_N_OE</name>
                <description>Output Enable control for EMMC Device Reset signal PAD
control.
This field drived sd_rst_n_oe output of DWC_mshc
Values:
- 0x1 (ENABLE): sd_rst_n_oe is 1
- 0x0 (DISABLE): sd_rst_n_oe is 0</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CQE_ALGO_SEL</name>
                <description>Scheduler algorithm selected for execution
This bit selects the Algorithm used for selecting one of the
many ready tasks for execution.
Values:
- 0x0 (PRI_REORDER_PLUS_FCFS): Priority based
reordering with FCFS to resolve equal priority tasks
- 0x1 (FCFS_ONLY): First come First serve, in the order of
DBR rings</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CQE_PREFETCH_DISABLE</name>
                <description>Enable or Disable CQE's PREFETCH feature
This field allows Software to disable CQE's data prefetch
feature when set to 1.
Values:
- 0x0 (PREFETCH_ENABLE): CQE can Prefetch data for
sucessive WRITE transfers and pipeline sucessive READ
transfers
- 0x1 (PREFETCH_DISABLE): Prefetch for WRITE and
Pipeline for READ are disabled</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BOOT_CTRL_R</name>
            <description>eMMC Boot Control register</description>
            <addressOffset>0x52E</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF181</resetMask>
            <fields>
              <field>
                <name>MAN_BOOT_EN</name>
                <description>Mandatory Boot Enable
This bit is used to initiate the mandatory boot operation. The
application sets this bit along with VALIDATE_BOOT bit.
Writing 0 is ignored. The DWC_mshc clears this bit after the
boot transfer is completed or terminated.
Values:
- 0x1 (MAN_BOOT_EN): Mandatory boot enable
- 0x0 (MAN_BOOT_DIS): Mandatory boot disable</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VALIDATE_BOOT</name>
                <description>Validate Mandatory Boot Enable bit
This bit is used to validate the MAN_BOOT_EN bit.
Values:
- 0x1 (TRUE): Validate Mandatory boot enable bit
- 0x0 (FALSE): Ignore Mandatory boot Enable bit</description>
                <bitRange>[7:7]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>BOOT_ACK_ENABLE</name>
                <description>Boot Acknowledge Enable
When this bit set, DWC_mshc checks for boot acknowledge
start pattern of 0-1-0 during boot operation. This bit is
applicable for both mandatory and alternate boot mode.
Values:
- 0x1 (TRUE): Boot Ack enable
- 0x0 (FALSE): Boot Ack disable</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BOOT_TOUT_CNT</name>
                <description>N/A</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GP_IN_R</name>
            <description>General Purpose Input register</description>
            <addressOffset>0x530</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>GP_IN</name>
                <description>It reflects the value of gp_in ports.
NOT USED - ALWAYS READS 0</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GP_OUT_R</name>
            <description>General Purpose Output register</description>
            <addressOffset>0x534</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>CARD_DETECT_EN</name>
                <description>0: Force card_detect_n input to 0
1:  Normal card_detect_n operation allowing card detection from a device pin</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_MECH_WRITE_PROT_EN</name>
                <description>0: Force card_mech_write_prot input to 0
1: Normal card_mech_write_prot operation allowing mechanical write protection from a device pin</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LED_CTRL_OE</name>
                <description>Active high output enable for the LED output signal led_ctrl controlled through HOST_CTRL1_R.LED_CTRL:
0: disable OE associated with the led_ctrl output
1: enable OE associated with the led_ctrl output</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_CLOCK_OE</name>
                <description>Active high output enable for the card clock output clk_card which is gated by CLK_CTRL_R.SD_CLK_EN:
0: disable OE to the clk_card output
1: enable OE to the clk_card output</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_IF_PWR_EN_OE</name>
                <description>Active high output enable for the card interface power enable output card_if_pwr_en controlled through PWR_CTRL_R.SD_BUS_PWR_VDD1:
0: disable OE to the card_if_pwr_en output
1: enable OE to the card_if_pwr_en output</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IO_VOLT_SEL_OE</name>
                <description>Active high output enable for the IO voltage selection signal io_volt_sel controlled through HOST_CTRL_2.SIGNALING_EN:
0: disable OE to the io_volt_sel output
1: enable OE to the io_volt_sel output</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_CLOCK_OUT_DLY</name>
                <description>Delay CARD_CLOCK output relative to CMD/DAT according to the following:
00: ~7 ns (Default - can be used for SD: DS, HS, SDR12 and SDR25; eMMC BWC and SDR)
01: ~5 ns (can be used for SD SDR50 and DDR50)
10: ~3 ns (can be used for eMMC DDR)
11: ~1 ns (may be useful in DDR modes in certain circumstances)</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_CLOCK_IN_DLY</name>
                <description>Delay CARD_CLOCK input internally to optimally sample CMD/DAT; interface protocol mode associaton to the 4 selections are TBD.</description>
                <bitRange>[9:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AT_CTRL_R</name>
            <description>Tuning and Auto-tuning control register</description>
            <addressOffset>0x540</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x1000004</resetValue>
            <resetMask>0xFF1F0F1F</resetMask>
            <fields>
              <field>
                <name>AT_EN</name>
                <description>Setting this bit enables Auto tuning engine. This bit is
enabled by default when core is configured with mode3
retuning support. Clear this bit to 0 when core is configured
to have Mode3 re-tuning but SW wishes to disable mode3 retuning.
This field should be programmed only when
CLK_CTRL_R.SD_CLK_EN is 0.
Values:
- 0x1 (AT_ENABLE): AutoTuning is enabled
- 0x0 (AT_DISABLE): AutoTuning is disabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CI_SEL</name>
                <description>Selects the interval when the corrected center phase select
code can be driven on tuning_cclk_sel output.
Values:
- 0x0 (WHEN_IN_BLK_GAP): Driven in block gap interval
- 0x1 (WHEN_IN_IDLE): Driven at the end of the transfer</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SWIN_TH_EN</name>
                <description>Sampling window Threshold enable
Selects the tuning mode
Field should be programmed only when SAMPLE_CLK_SEL
is '0'
Values:
- 0x1 (THRESHOLD_MODE): Tuning engine selects the
first complete sampling window that meets the threshold
set by SWIN_TH_VAL field
- 0x0 (LARGEST_WIN_MODE): Tuning engine sweeps all
taps and settles at the largest window</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RPT_TUNE_ERR</name>
                <description>Framing errors are not generated when executing tuning.
This debug bit allows users to report these errors.
Values:
- 0x1 (DEBUG_ERRORS): Debug mode for reporting
framing errors
- 0x0 (ERRORS_DISABLED): Default mode where as per
SD-HCI no errors are reported.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SW_TUNE_EN</name>
                <description>This fields enables software-managed tuning flow.
Values:
- 0x1 (SW_TUNING_ENABLE): Software-managed tuning
enabled. AT_STAT_R.CENTER_PH_CODE Field is now
writable.
- 0x0 (SW_TUNING_DISABLE): Software-managed tuning
disabled.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WIN_EDGE_SEL</name>
                <description>This field sets the phase for Left and Right edges for drift
monitoring. [Left edge offset + Right edge offset] must not be
less than total taps of delayLine.
- 0x0: User selection disabled. Tuning calculated edges are
used.
- 0x1: Right edge Phase is center + 2 stages, Left edge
Phase is center - 2 stages.
- 0x2: Right edge Phase is center + 3 stages, Left edge
Phase is center - 3 stages.
- ...
- 0xF: Right edge Phase is center + 16 stages, Left edge
Phase is center - 16 stages.</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TUNE_CLK_STOP_EN</name>
                <description>Clock stopping control for Tuning and auto-tuning circuit.
When enabled, clock gate control output 
(clk2card_on) is pulled low before changing phase select
codes on tuning_cclk_sel and autotuning_cclk_sel. This
effectively stops the Device/Card clock, cclk_rx and also
drift_cclk_rx. Changing phase code when clocks are stopped
ensures glitch free phase switching. Set this bit to 0 if the
PHY or delayline can guarantee glitch free switching.
Values:
- 0x1 (ENABLE_CLK_STOPPING): Clocks stopped during
phase code change
- 0x0 (DISABLE_CLK_STOPPING): Clocks not stopped.
PHY ensures glitch free phase switching.</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PRE_CHANGE_DLY</name>
                <description>Maximum Latency specification between cclk_tx and cclk_rx.
Values:
- 0x0 (LATENCY_LT_1): Less than 1-cycle latency
- 0x1 (LATENCY_LT_2): Less than 2-cycle latency
- 0x2 (LATENCY_LT_3): Less than 3-cycle latency
- 0x3 (LATENCY_LT_4): Less than 4-cycle latency</description>
                <bitRange>[18:17]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>POST_CHANGE_DLY</name>
                <description>Time taken for phase switching and stable clock output.
Specifies the maximum time (in terms of cclk cycles) that the
delay line can take to switch its output phase after a change
in tuning_cclk_sel or autotuning_cclk_sel.
Values:
- 0x0 (LATENCY_LT_1): Less than 1-cycle latency
- 0x1 (LATENCY_LT_2): Less than 2-cycle latency
- 0x2 (LATENCY_LT_3): Less than 3-cycle latency
- 0x3 (LATENCY_LT_4): Less than 4-cycle latency</description>
                <bitRange>[20:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SWIN_TH_VAL</name>
                <description>Sampling window threshold value setting
The maximum value that can be set here depends on the
length of delayline used for tuning. A delayLine with 128 taps
can use values from 0x0 to 0x7F.
This field is valid only when SWIN_TH_EN is '1'. Should be
programmed only when SAMPLE_CLK_SEL is '0'
- 0x0 - Threshold values is 0x1, windows of length 1 tap
and above can be selected as sampling window.
- 0x1 - Threshold values is 0x2, windows of length 2 taps
and above can be selected as sampling window.
- 0x2 - Threshold values is 0x1, windows of length 3 taps
and above can be selected as sampling window.
- ........
- 0x7F - Threshold values is 0x1, windows of length 127
taps and above can be selected as sampling window.</description>
                <bitRange>[31:24]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AT_STAT_R</name>
            <description>Tuning and Auto-tuning status register</description>
            <addressOffset>0x544</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFF</resetMask>
            <fields>
              <field>
                <name>CENTER_PH_CODE</name>
                <description>Centered Phase code. Reading this field returns the current
value on tuning_cclk_sel output. Setting
AT_CTRL_R.SW_TUNE_EN enables software to write to
this field and its contents are reflected on tuning_cclk_sel.</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>R_EDGE_PH_CODE</name>
                <description>Right Edge Phase code. Reading this field returns the phase
code value used by Auto-tuning engine to sample data on
Right edge of sampling window.</description>
                <bitRange>[15:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>L_EDGE_PH_CODE</name>
                <description>Left Edge Phase code. Reading this field returns the phase
code value used by Auto-tuning engine to sample data on
Left edge of sampling window.</description>
                <bitRange>[23:16]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
