cypress/pdl/devices/psoc6/svd/psoc6a2m.svd
          <register>
            <name>EMBEDDED_CTRL_R</name>
            <description>Embedded Control register</description>
            <addressOffset>0xF6C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7F777F37</resetMask>
            <fields>
              <field>
                <name>NUM_CLK_PIN</name>
                <description>Number of Clock Pins (SD Mode)
This field indicates support of clock pins to select one of
devices for shared bus system. Up to 7 clock pins can be
supported.
- 0x0 - Shared bus is not supported
- 0x1 - 1 SDCLK is supported
- 0x2 - 2 SDCLK is supported
- . .
- . .
- . .
- 0x7 - 7 SDCLK is supported</description>
                <bitRange>[2:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>NUM_INT_PIN</name>
                <description>Number of Interrupt Input Pins
This field indicates support of interrupt input pins for an
embedded system.</description>
                <bitRange>[5:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BUS_WIDTH_PRESET</name>
                <description>Bus Width Preset (SD Mode)
Each bit of this field specifies the bus width for each
embedded device. The shared bus supports mixing of 4-bit
and 8-bit bus width devices.
- D08 - Bus Width Preset for Device 1
- D09 - Bus Width Preset for Device 2
- D10 - Bus Width Preset for Device 3
- D11 - Bus Width Preset for Device 4
- D12 - Bus Width Preset for Device 5
- D13 - Bus Width Preset for Device 6
- D14 - Bus Width Preset for Device 7
Function of each bit is defined as follows:
- 0 - 4-bit bus width mode
- 1 - 8-bit bus width mode</description>
                <bitRange>[14:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CLK_PIN_SEL</name>
                <description>Clock Pin Select (SD Mode)
This bit is selected by one of clock pin outputs.
- 0x0 - Clock pins are disabled
- 0x1 - CLK[1] is selected
- 0x2 - CLK[2] is selected
- . .
- . .
- . .
- 0x7 - CLK[7] is selected</description>
                <bitRange>[18:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_PIN_SEL</name>
                <description>Interrupt Pin Select
These bits enable the interrupt pin inputs.
- 000 - Interrupts (INT_A,INT_B,INT_C) are disabled
- xx1 - INT_A is enabled
- x1x - INT_B is enabled
- 1xx - INT_C is enabled</description>
                <bitRange>[22:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BACK_END_PWR_CTRL</name>
                <description>Back-End Power Control (SD Mode)
Each bit of this field controls back-end power supply for an
embedded device.
- 0 - Back-End Power is off
- 1 - Back-End Power is supplied
D24 - Back-End Power for Device 1
D25 - Back-End Power for Device 2
D26 - Back-End Power for Device 3
D27 - Back-End Power for Device 4
D28 - Back-End Power for Device 5
D29 - Back-End Power for Device 6
D30 - Back-End Power for Device 7</description>
                <bitRange>[30:24]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="SDHC0">
      <name>SDHC1</name>
      <baseAddress>0x40470000</baseAddress>
    </peripheral>
    <peripheral>
      <name>SCB0</name>
      <description>Serial Communications Block (SPI/UART/I2C)</description>
      <headerStructName>SCB</headerStructName>
      <baseAddress>0x40600000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Generic control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x300000F</resetValue>
          <resetMask>0x83031F0F</resetMask>
          <fields>
            <field>
              <name>OVS</name>
              <description>N/A</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EC_AM_MODE</name>
              <description>This field specifies the clocking for the address matching (I2C) or slave selection detection logic (SPI)
'0': Internally clocked mode 
'1': Externally clocked mode 

In internally clocked mode, the serial interface protocols run off the SCB clock. In externally clocked mode, the serial interface protocols run off the clock as provided by the serial interface.

The clocking for the rest of the logic is determined by CTRL.EC_OP_MODE.

Externally clocked mode is only used for synchronous serial interface protocols (SPI and I2C) in slave mode. In SPI mode, only Motorola submode (all Motorola modes: 0, 1, 2, 3) is supported.

In UART mode this field should be '0'.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EC_OP_MODE</name>
              <description>This field specifies the clocking for the SCB block
'0': Internally clocked mode 
'1': externally clocked mode
 In internally clocked mode, the serial interface protocols run off the SCB clock. In externally clocked mode, the serial interface protocols run off the clock as provided by the serial interface. 

Externally clocked operation mode is only used for synchronous serial interface protocols (SPI and I2C) in slave mode AND EZ mode. In SPI mode, only Motorola submode (all Motorola modes: 0, 1, 2, 3) is supported. The maximum SPI slave, EZ mode bitrate is 48 Mbps (transmission and IO delays outside the IP will degrade the effective bitrate).

In UART mode this field should be '0'.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EZ_MODE</name>
              <description>Non EZ mode ('0') or EZ mode ('1').
In EZ mode, a meta protocol is applied to the serial interface protocol. This meta protocol adds meaning to the data frames transferred by the serial interface protocol: a data frame can represent a memory address, a write memory data element or a read memory data element. EZ mode is only used for synchronous serial interface protocols: SPI and I2C. In SPI mode, only Motorola submode (all Motorola modes: 0, 1, 2, 3) is supported and the transmitter should use continuous data frames; i.e. data frames not seperated by slave deselection. This mode is only applicable to slave functionality. In EZ mode, the slave can read from and write to an addressable memory structure of 32 bytes. In EZ mode, data frames should 8-bit in size and should be transmitted and received with the Most Significant Bit (MSB) first.

In UART mode this field should be '0'.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE_MODE</name>
              <description>N/A</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_RESP_MODE</name>
              <description>N/A</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR_ACCEPT</name>
              <description>Determines whether a received matching address is accepted in the RX FIFO ('1') or not ('0').

